{"text": "ID: 235\tTITLE: A Sailor-Made Man\tGENRE: Comedy\tPLOT: When The Girl's father insists that, before he will agree to The Boy's marrying his daughter, he must first prove that he can do something more worthwhile than act the playboy. He joins the navy. When his ship docks at a Middle Eastern kingdom, The Girl and her father also arrive by yacht. The local maharajah kidnaps The Girl and it is up to The Boy to rescue her.", "labels": []}
{"text": "ID: 469\tTITLE: The Karnival Kid\tGENRE: Animation, Short, Comedy\tPLOT: ______ is selling hot dogs at a carnival next to the tent for ________________________. He gets into an argument with the barker. ______ beckons him over to her trailer; he shows off the tricks his pups have been trained to do, and she picks one. It climbs onto the bun but runs away when she bites in. Later that evening, ______ plays guitar and two cats sing outside Minnie's window; they eventually awaken someone, who throws things at them until they stop.", "labels": ["PROTA_0", "FLAT_0", "PROTA_1", "PROTA_0"]}
{"text": "ID: 564\tTITLE: The Criminal Code\tGENRE: Crime, Drama, Romance\tPLOT: A wily D.A.(Brady) gets a 10 year conviction of a young 20 year old (Robert Graham)who he knows killed a man in self defense. Years later _____ becomes warden of the prison holding ______. When _____ realizes that 6 years of working in the prison jute mill has pushed ______ to the breaking point, he gives him a chance- a new job as his valet. ______ responds well and earns the respect of both the warden and his beautiful daughter. Graham's mettle is put to the test when he stumbles onto a prison murder committed by his cell-mate. He must choose between the criminal code of silence and the warden's strong persuasion to reveal the killer.", "labels": ["PROTA_0", "ANTAG_0", "PROTA_0", "PROTA_1", "PROTA_1"]}
{"text": "ID: 417\tTITLE: The Last Command\tGENRE: Drama, History, Romance, War\tPLOT: A decorated, aristocratic _______________ is reduced to penury after the collapse of Imperial ______. An old adversary, now a successful ________ hires the general to re-enact the revolution which deposed him.", "labels": ["PROTA_0", "LOC_0", "OCCUP_0"]}
{"text": "ID: 254\tTITLE: Nosferatu\tGENRE: Fantasy, Horror\tPLOT: ________, _______ based estate agent Knock dispatches his associate, ______, to Count Orlok's castle in Transylvania as the Count wants to purchase an isolated house in ________. They plan on selling him the one across the way from Hutter's own home. ______ leaves his innocent wife, _____, with some friends while he is away. Hutter's trek is an unusual one, with many locals not wanting to take him near the castle where strange events have been occurring. Once at the castle, ______ does manage to sell the Count the house, but he also notices and feels unusual occurrences, primarily feeling like there is a dark shadow hanging over him, even in the daytime when the Count is unusually asleep. ______ eventually sees the Count's sleeping chamber in a crypt, and based on a book he has recently read, believes the Count is really a vampire or _________. While ______ is trapped in the castle, the Count, hiding in a shipment of coffins, makes his way to ________, causing death along his way, which most attribute to the plague. ______ himself tries to rush home to save his town and most importantly save _____ from Nosferatu's imminent arrival. In ________, _____ can feel the impending darkness as _________ gets closer. But she learns that a sinless woman can sacrifice herself to kill the vampire. Will ______ be able to save _____ either from _________ and/or her self-sacrifice?", "labels": ["PROTA_0", "LOC_0", "FLAT_0", "LOC_1", "ANTAG_0", "PROTA_1", "LOC_2", "PROTA_2", "LOVE_0", "PROTA_2", "LOC_1", "PROTA_2", "LOVE_1", "LOC_1", "FLAT_1", "LOVE_0", "PROTA_2", "LOVE_1", "LOC_3"]}
{"text": "ID: 140\tTITLE: His Wedding Night\tGENRE: Short, Comedy\tPLOT: In a drugstore Al and ______ are rivals for Alice. ______ slings melons and operates the gas pump. ______ delivers a wedding gown for Alice, begins modeling it, is mistaken for _____ and is kidnapped by Al.", "labels": ["PROTA_0", "PROTA_0", "PROTA_1", "FLAT_0"]}
{"text": "ID: 579\tTITLE: Indiscreet\tGENRE: Comedy, Romance\tPLOT: ___________ is a ______ based actress. She has been unable to find love in her life. The reason why she came home early from a vacation to _______ fits into that theme, as the man she met there and was initially attracted to ended up not being who she thought he was as a man. Upon her arrival home, she meets the suave ____________, a financier who is a work acquaintance of her brother-in-law, ________ _____________. ______ initially states that there is no Mrs. _____ in his life. But when ____ later asks him out, he clarifies that statement in that there is no Mrs. _____ in ______, as she is at home in _____________. Regardless, ____ decides still to ask him on the date she had intended to the ballet. He accepts, letting her know that whatever happens between the two of them that he will never be able to leave his wife. As time goes on, the two fall in love, their happiness which can only be sustained as long as ______ has his Paris-based contract with NATO. So when ______ announces that he is being transferred to ________ for five months, ____ comes to the realization that she truly cannot live without him and wants to marry him. Shortly thereafter, ____ learns something about Philip's background, which not only threatens their relationship, but leads to a night that ____ wants to give him that he will never forget, and not in a good way. But the best laid plans may have a bumpy road to being executed effectively...", "labels": ["PROTA_0", "LOC_0", "LOC_1", "PROTA_1", "OCCUP_0", "LOVE_0", "PROTA_1", "FLAT_0", "PROTA_0", "FLAT_0", "LOC_0", "LOC_2", "PROTA_0", "PROTA_1", "PROTA_1", "LOC_3", "PROTA_0", "PROTA_0", "LOVE_1"]}
{"text": "ID: 9\tTITLE: The Music Lover\tGENRE: Short, Comedy, Music\tPLOT: A marching band appears, and the band-leader prepares to give them the music for the song he wants them to play. He has prepared a large staff above their heads, and he now creates notes by making duplicates of his own head, placing them on the staff, and completing the notes with sticks and other implements taken from the band members. When he has finished, the players attempt to perform the music that has been written in such an unusual fashion.", "labels": []}
{"text": "ID: 549\tTITLE: Bad Girl\tGENRE: Drama, Romance\tPLOT: A mug and a jane: _______ knows that every guy is going to make a pass at her; _____ knows that every gal wastes her money on good times. He's saving to open a repair shop. When the two of them meet, they can't believe they get along. One evening he leaves her waiting in the rain; she finds his apartment and reads him the riot act. They end up spooning and napping until 4 AM. She's afraid of her brother, who's her guardian, so _____ figures she should tell her brother that she's getting married the next morning. _______ tries out the story but knows _____ won't show up. It's the first of a series of promises, fears, miscalculations, and hard knocks. Where will they end up?", "labels": ["PROTA_0", "FLAT_0", "PROTA_1", "PROTA_0", "PROTA_1"]}
{"text": "ID: 511\tTITLE: Escape from Dartmoor\tGENRE: Crime, Drama\tPLOT: Flashback story of an escape from the lonely, high-security Dartmoor Prison. A jealous __________________ is enraged by the attentions that his manicurist girlfriend pays to a customer. He threatens the customer with an open razor and lands in gaol.", "labels": ["OCCUP_0"]}
{"text": "ID: 84\tTITLE: The Rounders\tGENRE: Comedy, Western\tPLOT: ___ and _____ are a couple of aging cowboys who bust broncos out of ______ for ___ Ed Love, a slick ________ if ever there was one. Sisters, ___ and ______, have their eyes on ___ and _____, but the boys aren't ready to settle down yet. They spend the winter in the high country corralling more than 100 stray cattle at $7 a head for ______. Most years, they blow their winter pay in one spring night at a ______ bar, but this year, ___ and _____ have a plan: to take an ornery roan that ___ has been unable to break and bet their bankroll that no cowboy at the ______ rodeo can stay on the horse. What will they do if they win - marry the sisters or head for Tahiti?", "labels": ["PROTA_0", "PROTA_1", "LOC_0", "PROTA_2", "OCCUP_0", "PROTA_3", "PROTA_4", "PROTA_0", "PROTA_1", "FLAT_0", "LOC_0", "PROTA_0", "PROTA_1", "PROTA_0", "ANTAG_0"]}
{"text": "ID: 48\tTITLE: Caught in a Cabaret\tGENRE: Short, Comedy\tPLOT: Given an hour off from his job as a cafe ______, _______ rescues _____ from a thug, is given an invitation to her home, and arrives presenting a card which falsely identifies him as the Greek Ambassador. Before he can get back to work, her parents invite him to a future garden party. Her jealous lover has _______ followed back to the cafe. _______ is a hit at the garden party but, as he leaves to return to work, the rival invites everyone to go with him to the cafe so Charlie will be exposed.", "labels": ["OCCUP_0", "PROTA_0", "LOVE_0", "PROTA_0", "PROTA_0"]}
{"text": "ID: 256\tTITLE: Pay Day\tGENRE: Comedy, Short\tPLOT: _______ is an expert bricklayer. He has lots of fun and work and enjoys himself greatly while at the saloon. As he leaves work his wife takes the pay he has hidden in his hat. But he steals her purse so he can go out for the evening. He has a terrible time getting home on a very rainy night. When he does so he finds his wife waiting for him with a rolling pin.", "labels": ["PROTA_0"]}
{"text": "ID: 284\tTITLE: Hot Water\tGENRE: Comedy\tPLOT: Episodic look at married life and in-law problems. Adventures include a ride on a crowded trolley with a live turkey; a wild spin in a new auto with the in-laws in tow; and a sequence in which _____ accidently chloroforms his mother-in-law and is convinced that he has killed her. When she begins sleep-walking, he thinks that she has returned to haunt him.", "labels": ["PROTA_0"]}
{"text": "ID: 184\tTITLE: Male and Female\tGENRE: Adventure, Drama\tPLOT: Lord Brockelhurst, his unwilling betrothed Lady ____, his butler ________ and scullery maid ______ are on Lord Loam's yacht which is wrecked leaving them all to cope on a desert island. Class distinctions fall apart for the time being.", "labels": ["FLAT_0", "PROTA_0", "PROTA_1"]}
{"text": "ID: 185\tTITLE: The Doll\tGENRE: Comedy, Fantasy\tPLOT: Because the ____________________ wants to preserve his family line, he forces his timid nephew ________ to choose one of the village maidens to wed. ________ flees to a monastery to escape the forty eager maidens. When the gluttonous monks discover that the _____ is offering a large sum for the marriage, they suggest ________ marry a mechanical doll instead. The doll maker has just finished making a replica of his daughter ____, but his _________ accidentally breaks it and convinces the real girl to mimic the doll. ________ buys her, thinking she is a doll, and takes her back to the monastery, where they are wed.", "labels": ["LOC_0", "PROTA_0", "PROTA_0", "ANTAG_0", "PROTA_0", "FLAT_0", "OCCUP_0", "PROTA_0"]}
{"text": "ID: 136\tTITLE: The Butcher Boy\tGENRE: Comedy, Drama\tPLOT: _______ and ___ live the usual playful, fantasy filled childhoods of normal boys. However, with a violent, alcoholic father and a manic depressive, suicidal mother the pressure on _______ to grow up are immense. Unfortunately, one tragedy after another, _______'s world sinks deeper and deeper into paranoia (directed mainly against Mrs. ______, a nasty neighbor) and fantasy (where he has visions of the Virgin ____).", "labels": ["PROTA_0", "PROTA_1", "PROTA_0", "PROTA_0", "FLAT_0", "FLAT_1"]}
{"text": "ID: 603\tTITLE: Platinum Blonde\tGENRE: Comedy, Romance\tPLOT: Reporter Gallagher loves ________ _____ who marries Anne. He's soon bored being married to a socialite and asks _________ to help him write a play. She arrives with a bunch of _________ and the mansion turns into a party. ____ arrives and orders them out and _____ goes with them.", "labels": ["OCCUP_0", "FLAT_0", "FLAT_1", "OCCUP_1", "ANTAG_0", "PROTA_0"]}
{"text": "ID: 233\tTITLE: The Two Orphans\tGENRE: Comedy\tPLOT: ______ nineteenth century : Two middle aged orphans _______ and ________ find out (thanks to a soothsayer) that one is the offspring of the Hangman of _____ and the other is the son of a count. But it is only a dream of theirs...", "labels": ["LOC_0", "FLAT_0", "PROTA_0", "LOC_1"]}
{"text": "ID: 483\tTITLE: Queen Kelly\tGENRE: Drama\tPLOT: Prince _______ is the betrothed of mad Queen ______ V of ________. Supreme ruler, her word is law and he is a playboy. On maneuvers as punishment for partying with other women, he sees _____ walking the the other students of a convent. He is intrigued by her beauty and wants her. He kidnaps her that night from the convent and takes her to his room and professes his love for her. When the Queen finds them together the next morning , she whips _____ and throws her out of the castle. ______ then puts _______ into prison for not wanting to marry the Queen. _____ goes to German East ______ to visit her dying ____ and is forced to marry the disgusting Jan. The Aunt dies after the wedding and _____ refuses to live with ___ and becomes the head of _______________. Her extravagances and style earn her the name 'Queen Kelly' and Prince _______ does not marry Queen Regina V.", "labels": ["PROTA_0", "PROTA_1", "LOC_0", "PROTA_2", "PROTA_2", "LOC_1", "PROTA_0", "PROTA_2", "LOC_2", "FLAT_0", "PROTA_2", "PROTA_3", "FLAT_1", "PROTA_0"]}
{"text": "ID: 379\tTITLE: The Love of Sunya\tGENRE: Drama\tPLOT: In ancient _____, an evil priest drove a pure maiden to suicide. In today's reincarnation, to free himself the priest must find and help the maiden...now a young American singing student, _____________, who is torn between pursuing a career in European opera, going to _____________ with fiancée ____, or saving her father from financial ruin by marrying wealthy Robert Goring. The ancient priest, reincarnated as a gypsy vagabond, grants her visions of her future life if she should follow each of the three roads. Does each have a fatal drawback?", "labels": ["LOC_0", "PROTA_0", "LOC_1", "FLAT_0"]}
{"text": "ID: 455\tTITLE: The Cocoanuts\tGENRE: Comedy, Musical\tPLOT: Mr. ______ runs a bankrupt _______ hotel. He'll try anything to make money, even make love to rich Mrs. ______. But his main scheme, selling real estate, is in danger of sabotage from zanies _____ and _____, who also reduce the schemes of a pair of jewel thieves to chaos. A subplot involves the star-crossed love of ____________ and _________ _________.", "labels": ["FLAT_0", "LOC_0", "FLAT_1", "PROTA_0", "PROTA_1", "FLAT_1", "OCCUP_0", "PROTA_2"]}
{"text": "ID: 477\tTITLE: The Mysterious Island\tGENRE: Adventure, Romance, Sci-Fi\tPLOT: On a volcanic island near the kingdom of ______ rules Count ______, a benevolent leader and _________ who has eliminated class distinction among the island's inhabitants. Dakkar, his daughter _____ and her fiance, ________ _____________ have designed a submarine which _____ pilots on its initial voyage just before the island is overrun by ___________, despotic ruler of ______. _____ sets out after Roget in a second submarine and the two craft, diving to the ocean's floor, discover a strange land populated by dragons, giant squid and an eerie undiscovered humanoid race.", "labels": ["PROTA_0", "PROTA_1", "OCCUP_0", "LOVE_0", "OCCUP_1", "LOVE_1", "PROTA_2", "FLAT_0", "LOC_0", "PROTA_3"]}
{"text": "ID: 583\tTITLE: Laughing Sinners\tGENRE: Drama, Romance\tPLOT: Cafe entertainer ___________ falls for sleazy salesman _____________ and jumps from a bridge when he dumps her. Saved by Salvation Army officer ____, ___ reforms and joins the Army. When she runs into ______ she falls for him all over again. ____ beats up ______ and gives a speech to Ivy which induces her to return to the Army and to ____.", "labels": ["PROTA_0", "FLAT_0", "PROTA_1", "PROTA_0", "FLAT_0", "PROTA_1", "PROTA_2", "FLAT_1"]}
{"text": "ID: 422\tTITLE: Lonesome\tGENRE: Comedy, Drama, Romance\tPLOT: A lonesome boy and a lonesome girl meet accidentally on their Saturday-off at ____________. It is love at fight sight but over the bewilderment of their sudden romance and escape from loneliness, they don't even realize they don'y even known each other's name until a fire breaks out and they are separated.", "labels": ["LOC_0"]}
{"text": "ID: 139\tTITLE: Easy Street\tGENRE: Short, Comedy\tPLOT: When _________________ wanders into a mission he is smitten by ____ and puts back the collection box which he has taken. Reformed, he becomes a _________ and is assigned to rough-and-tumble Easy Street. Unable to trick or beat ____ the Tough, he puts ____'s head in a gas pipe and anesthetizes him. A hero, he now helps many poor people living on Easy Street. ____ escapes jail, ____ is kidnapped, but _______ (recharged after sitting on a doper's needle) conquers all. Easy Street is transformed as is ____.", "labels": ["PROTA_0", "LOVE_0", "OCCUP_0", "FLAT_0", "PROTA_1", "PROTA_1", "LOVE_0", "PROTA_0", "LOVE_1"]}
{"text": "ID: 55\tTITLE: The Fatal Mallet\tGENRE: Short, Comedy\tPLOT: _______ throws a brick at a man and woman and gets it thrown back at him. The rivals fight. The lady leaves with a third suitor. _______ finds a wooden mallet with which he subdues both rivals, locking them in a barn. He kicks the lady who instantly falls for him.", "labels": ["PROTA_0", "PROTA_0"]}
{"text": "ID: 465\tTITLE: The Hollywood Revue of 1929\tGENRE: Musical\tPLOT: ____________, representing the Hollywood movie community, and __________, representing the ________ stage community, act as the interlocutors of a musical comedy revue. A plethora of chorus boys and girls are featured front and center in some of the song and dance numbers, and provide back-up to some other acts. But the revue primarily is a vehicle to highlight a cavalcade of _________ movie and ________ stage stars. One early running gag has both _____ and _____ playing straight man to _____________, who just wants a nice introduction to his act. _______ would return later to be featured along with the Brox Sisters in one of the highlights of the second act, a production number around the song \"Singin' in ____\", complete with rain soaked stage. A reprise of the song with the entire cast acts as the revue's finale.", "labels": ["ANTAG_0", "PROTA_0", "LOC_0", "LOC_1", "LOC_0", "PROTA_1", "PROTA_0", "ANTAG_1", "PROTA_2", "LOVE_0"]}
{"text": "ID: 460\tTITLE: Woman in the Moon\tGENRE: Comedy, Drama, Romance, Sci-Fi\tPLOT: Thirty years ago, at a scientific conference, Prof. Manfeldt presented his theory on the existence of gold on the Moon. It was greeted with laughter by the assembled academics. Today, ___________ has ambitious plans to build a spaceship... and take it to the Moon! Windegger, his chief engineer, will be going, and so will Prof. ________, now living in a cramped garret alone with his theory. But there are disagreements with the financiers who insist that their man ______ also accompany the flight... The unmanned Rocket H 32 brings back valuable information from the dark side of the Moon. ______ is upset by the news of Windegger's engagement to the pretty Friede. And the financiers have a secret agenda: to control the world's gold supply... Finally, the Spaceship \"______\" is ready as it rolls out on its gantry for takeoff. The staged rocket works as planned, but the acceleration is fierce. As they approach the Moon, they discover a stowaway on board, ______, a little boy...", "labels": ["PROTA_0", "PROTA_1", "ANTAG_0", "PROTA_0", "LOVE_0", "PROTA_2"]}
{"text": "ID: 61\tTITLE: His Favorite Pastime\tGENRE: Short, Comedy\tPLOT: _______ gets into a fight at his regular bar and finally crawls out under the door. He then boards a streetcar and follows a beautiful lady in a taxi. He breaks into her home. Her husband comes finds him trying to seduce his wife.", "labels": ["PROTA_0"]}
{"text": "ID: 354\tTITLE: The Temptress\tGENRE: Drama, Romance\tPLOT: In a masked ball in _____, ______________, a young Argentinian architect, meets _____, the Marquess of ____________. Later, the young woman is rightly accused causing the misfortune and loss of wealth of ________, a man who fell for her charms. To escape social criticism, the Marquis of ____________ transfers his residence to _________. There, _____ meets again ______, when he is building a river's dam. ___________, a thug, harasses _____, and when ______ intervenes, he defies him to a whip duel. The duel is long and vicious, both men suffering many cuts on their faces and naked chests, but in the end, the thug is vanquished and humiliated. ___________ sets up an ambush to murder ______, but the Marquis of ____________ is killed instead. Now, there only two men in love for _____, the eternal temptress^Å", "labels": ["LOC_0", "FLAT_0", "PROTA_0", "LOC_1", "PROTA_1", "LOC_1", "LOC_2", "PROTA_0", "PROTA_2", "PROTA_3", "LOVE_0", "PROTA_2", "PROTA_3", "PROTA_2", "FLAT_1", "PROTA_0"]}
{"text": "ID: 428\tTITLE: The Racket\tGENRE: Crime, Drama, Film-Noir, Thriller\tPLOT: The big national crime _________ has moved into town, partnering up with local crime ____ ____________. There are only two problems: First, ____ is the violent type, preferring to do things the old-fashioned way instead of using the syndicate's more genteel methods. The second problem is McQuigg, the only honest police captain on the force, and his loyal patrolman, _______. Together, they take on the violent ____ and try to foil the syndicate's plans to elect _____, the crooked __________ running for a crooked judgeship.", "labels": ["OCCUP_0", "OCCUP_1", "FLAT_0", "PROTA_0", "PROTA_1", "PROTA_0", "PROTA_2", "OCCUP_2"]}
{"text": "ID: 82\tTITLE: Recreation\tGENRE: Comedy, Short\tPLOT: _______ is walking in the park. A girl leaves a seaman on one bench and joins _______ on another. The seaman wakes up. He and _______ stage a brick fight. Policemen get hit and arrest both men. During an ensuing fight on the dock the _________, the seaman, _______ and the girl wind up in the water.", "labels": ["PROTA_0", "PROTA_0", "PROTA_0", "OCCUP_0", "PROTA_0"]}
{"text": "ID: 433\tTITLE: Spies\tGENRE: Romance, Thriller\tPLOT: Haghi is a criminal mastermind whose ubiquitous spy operation is always several steps ahead of the police and the government's secret service. Enter Agent 326, the daring and dashing young man, who thinks his disguise as a dirty, bearded vagrant is fooling the unknown mastermind and his minions. But _____ is well aware of 326's existence and what he looks like. ___________, a Russian lady in Haghi's employ. _____ wants _____ to subvert the efforts of the government agent, but doesn't count on her falling in love with him. Meanwhile, _____ is anxious to get his hands on a Japanese peace treaty in the possession of the cunning _______________, whose mistress is also in his employ.", "labels": ["PROTA_0", "PROTA_1", "ANTAG_0", "PROTA_1", "PROTA_0", "ANTAG_1"]}
{"text": "ID: 183\tTITLE: The Cabinet of Dr. Caligari\tGENRE: Fantasy, Horror, Mystery, Thriller\tPLOT: _______, a young man, recalls in his memory the horrible experiences he and his fiancée ____ recently went through. It is the annual fair in Holstenwall. _______ and his friend ____ visit The Cabinet of Dr. ________, an exhibit where the mysterious doctor shows the somnambulist ______, and awakens him for some moments from his death-like sleep. When ____ asks ______ about his future, ______ answers that he will die before dawn. The next morning ____ is found dead. _______ suspects Cesare of being the murderer, and starts spying on him and Dr. ________. The following night ______ is going to stab ____ in her bed, but softens when he sees the beautiful woman, and instead of committing another murder, he abducts her. Jane's father awakens because of the noise, and he and some servants follow the fleeing ______. When ______ cannot outrun his pursuers anymore, he gently places ____ down on the ground, and runs away. _______ and the ______ investigate the caravan of Dr. ________, but the doctor succeeds in slipping away. _______ pursues the fleeing Dr. ________, and sees him disappear into a madhouse. _______ enters the madhouse, where he is sure he will find the truth behind all these mysterious events.", "labels": ["PROTA_0", "PROTA_1", "PROTA_0", "PROTA_2", "FLAT_0", "PROTA_3", "PROTA_2", "FLAT_1", "PROTA_3", "PROTA_2", "PROTA_0", "FLAT_0", "PROTA_3", "LOVE_0", "PROTA_3", "FLAT_1", "PROTA_1", "PROTA_0", "OCCUP_0", "PROTA_4", "PROTA_0", "PROTA_4", "PROTA_0"]}
{"text": "ID: 319\tTITLE: The Monster\tGENRE: Drama, Fantasy, Horror\tPLOT: _____ is the alcoholic and smoking addicted mother of the young, but mature teenager _____. They live together since Kathy's husband ___ left her, and she neglects her daughter. _____ is supposed to drive _____ to her father's home in the morning, but she sleeps until late afternoon and they have to travel during a rainy night. While driving through a lonely road through the woods, _____ hits a wolf that breaks her car, leaving them stranded on the empty road. They call 911 and while waiting for the tow truck and an ambulance, the wolf disappears from the road. When the tow truck arrives, the mechanic _____ tells that he needs to fix the axle and an oil leakage to tow her car. While repairing the vehicle, a monster attacks him but neither _____ nor _____ note. When they seek _____ out, they realize that they are not alone in the spot. Further, _____ learns that monsters do exist. Will they be rescued on time?", "labels": ["PROTA_0", "FLAT_0", "PROTA_1", "PROTA_0", "PROTA_2", "PROTA_0", "PROTA_3", "PROTA_0", "PROTA_2", "PROTA_3", "PROTA_0"]}
{"text": "ID: 307\tTITLE: The Eagle\tGENRE: Action, Adventure, Drama, History, War\tPLOT: In 140 AD, twenty years after the unexplained disappearance of the entire Ninth Legion in the mountains of Scotland, young centurion _____________ (Tatum) arrives from ____ to solve the mystery and restore the reputation of his father, the commander of the Ninth. Accompanied only by his British slave ____ (Bell), ______ sets out across Hadrian's Wall into the uncharted highlands of Caledonia - to confront its savage tribes, make peace with his father's memory, and retrieve the lost legion's golden emblem, the Eagle of the Ninth.", "labels": ["FLAT_0", "LOC_0", "PROTA_0", "ANTAG_0"]}
{"text": "ID: 586\tTITLE: M\tGENRE: Crime, Mystery, Thriller\tPLOT: In _______, ____________ is an unknown ______ of girls. He whistles ____________'s 'In The Hall of the Mountain King', from the 'Peer Gynt' Suite I Op. 46 while attracting the little girls for death. The police force pressed by the Minister give its best effort trying unsuccessfully to arrest the _____________. The organized crime has great losses due to the intense search and siege of the police and decides to chase the murderer, with the support of the beggars association. They catch ____ and briefly judge him.", "labels": ["LOC_0", "PROTA_0", "OCCUP_0", "PROTA_1", "OCCUP_0", "FLAT_0"]}
{"text": "ID: 202\tTITLE: Number, Please?\tGENRE: Short, Comedy, Romance\tPLOT: ______ is spending the day at the amusement park, unfulfilled and alone. He thinks his day has the possibility of looking up when he spots _______, the girl of his dreams, on a date at the park with ___. ______ thinks he can take _______ away from ___. ______ does whatever he can to impress _______, while putting ___ in a bad light. Ultimately, _______, who has two tickets for a romantic hot air balloon ride, says that she will take that ride with whoever can get the approval from her mother to do so first. ______ gets into one misadventure after another in the entire process, which includes being in possession of a stolen purse, which he is unaware belongs to _______ and which contains the two tickets.", "labels": ["PROTA_0", "LOVE_0", "PROTA_1", "PROTA_0", "LOVE_0", "PROTA_1", "PROTA_0", "LOVE_0", "PROTA_1", "LOVE_0", "PROTA_0", "LOVE_0"]}
{"text": "ID: 52\tTITLE: Dough and Dynamite\tGENRE: Comedy, Short\tPLOT: _______ and another waiter must become bakers when the regular bakers go out on strike. The strikers put dynamite in a piece of bread which is delivered to the cake counter. It winds up in the oven and explodes.", "labels": ["PROTA_0"]}
{"text": "ID: 194\tTITLE: An Eastern Westerner\tGENRE: Comedy, Short, Family, Western\tPLOT: A young New Yorker is the bane of his Christian parent's existence because of his constant carousing and partying at all hours. As such, his father decides to send the young man to live at ranch of his uncle in Piute Pass in the wild west to get him away from the ________ temptations that lead to this unwanted behavior. Before he even gets to the ranch, the young man gets into one misadventure after another using his New York sensibilities in __________. His primary misadventure involves a sweet young ingénue, the two who fall for each other at first sight. Her father is being held captive by \"___________________, who owns half the county and bullies the rest with his band called the Masked Angels. The ransom is her womanly favors to him. The young man tries to help free the father so that the young man and the ingénue can live happily ever after together, which does not sit well with Tiger Lip and the Masked Angels.", "labels": ["LOC_0", "LOC_1", "FLAT_0", "PROTA_0"]}
{"text": "ID: 532\tTITLE: Our Blushing Brides\tGENRE: Drama\tPLOT: Three department store girls--______, ______, and _____--share an apartment on West 91st Street in _____________. Each earns little more than 20 dollars per week. _____ is the sensible one, but the others throw themselves at amoral rich men in an attempt to hook one and better themselves. They end up being hurt and disappointed despite _____'s attempts to warn them.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "LOC_0", "PROTA_2", "PROTA_2"]}
{"text": "ID: 98\tTITLE: The Cheat\tGENRE: Drama, Romance\tPLOT: ___________ uses charity funds for Wall Street investments in hopes of buying some new gowns. She loses all the money and borrows from wealthy oriental ____. When her husband gives her the amount she borrowed, ____ won't take it back, branding her shoulder with a Japanese sign of his ownership. She shoots him. Her husband takes the blame. In court _____ reveals all to an angry mob.", "labels": ["PROTA_0", "LOVE_0", "LOVE_0", "PROTA_0"]}
{"text": "ID: 62\tTITLE: His Musical Career\tGENRE: Short, Comedy\tPLOT: _______ and his partner are to deliver a piano to 666 Prospect St. and repossess one from 999 Prospect St. They confuse the addresses. The difficulties of delivering the piano by mule cart, and most of the specific gags, appeared later in ______ and Hardy's \"The Music Box\".", "labels": ["PROTA_0", "LOVE_0"]}
{"text": "ID: 249\tTITLE: Foolish Wives\tGENRE: Drama, Thriller\tPLOT: \"Count\" Karanzim, a ________ is with his cousins in ___________, living from faked money and the money he gets from rich ladies, who are attracted by his charmes and his title or his militaristic and aristocratic behaviour. He tries to have success with Mrs Hughes, the wife of the new US ambassador.", "labels": ["PROTA_0", "LOC_0"]}
{"text": "ID: 454\tTITLE: Bulldog Drummond\tGENRE: Drama, Mystery, Thriller\tPLOT: Hugh 'Bulldog' ________ is a British WWI veteran who longs for some excitement after he returns to the humdrum existence of civilian life. He gets what he's looking for when a girl requests his help in freeing her uncle from a nursing home. She believes the home is just a front and that her uncle is really being held captive while the culprits try to extort his fortune from him.", "labels": ["PROTA_0"]}
{"text": "ID: 513\tTITLE: The Divorcee\tGENRE: Romance, Drama\tPLOT: _____ and ___ are young, in love, and part of the New York 'in-crowd'. Jerry's decision to marry ___ crushes a yearning ____. Distraught ____ gets drunk and wrecks his car, disfiguring young _______'s face in the process. Out of pity, ____ marries _______. Years later, the apparent perfect marriage of ___ and _____ falls apart from infidelity on both sides. Inwardly unhappy, popular Jerry lives a party life while ___ sinks into a life of alcoholism. _____ then runs into ____, who still loves her. After spending time together with _____, ____ plans to divorce _______. When _____ sees _______ again, she has second thoughts about where her life is heading.", "labels": ["PROTA_0", "PROTA_1", "PROTA_1", "FLAT_0", "FLAT_0", "PROTA_2", "PROTA_3", "PROTA_2", "PROTA_1", "PROTA_0", "PROTA_1", "PROTA_0", "FLAT_0", "PROTA_0", "FLAT_0", "PROTA_2", "PROTA_0", "PROTA_2"]}
{"text": "ID: 389\tTITLE: Spring Fever\tGENRE: Drama\tPLOT: Hired to spy on a philandering husband, Luo ______ soon becomes entangled in a clandestine affair with the other man. Along with Luo's girlfriend, they succumb to the delirium of drunken nights, but how long can their tryst last?", "labels": ["PROTA_0"]}
{"text": "ID: 500\tTITLE: Another Fine Mess\tGENRE: Comedy, Short\tPLOT: Homeless, penniless and one step ahead of the police, _______ and ______ take refuge in the home of big-game hunter ________________ while the owner is on safari. When Lord and Lady ________ call to enquire about renting the house, ______ pretends to be ________________, while _______ masquerades as both ______ and maid. All goes as well as can be expected, with Lady ________ and _______, in his guise as \"_____,\" engaging in girl talk, until the real Colonel ________ returns unexpectedly.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "FLAT_0", "PROTA_1", "PROTA_2", "PROTA_0", "OCCUP_0", "FLAT_0", "PROTA_0", "FLAT_1", "PROTA_2"]}
{"text": "ID: 479\tTITLE: Our Modern Maidens\tGENRE: Drama, Comedy\tPLOT: Young vivacious ______ uses her charms on influential ___________ ____________ in hopes of getting her secret fiancée ___ a diplomatic appointment. Meanwhile ___'s affections meander to beautiful ingenue ________, ______'s best friend. After securing ___'s appointment, ______ is crushed to learn of Billie's impending marriage. What ______ didn't count on was ___ getting ________ pregnant. This throws her wedding day into scandal and creates turmoil in the lives of the youthful quartet.", "labels": ["PROTA_0", "OCCUP_0", "LOVE_0", "PROTA_1", "PROTA_1", "LOC_0", "PROTA_0", "LOVE_1", "PROTA_2", "PROTA_0", "ANTAG_0", "PROTA_3"]}
{"text": "ID: 152\tTITLE: The Outlaw and His Wife\tGENRE: Drama\tPLOT: A stranger comes to work at widow Halla's farm. Halla and the stranger fall in love, but when he is revealed as ______, an escaped thief forced into crime by his family's starvation, they flee and become two of the many outlaws of Iceland's mountains.", "labels": ["PROTA_0"]}
{"text": "ID: 361\tTITLE: The Battle of the Century\tGENRE: Short, Comedy\tPLOT: Fight _______ (Hardy) takes out an insurance policy on his puny pugilist (______) and then proceeds to try to arrange for an accident so that he can collect. When a pie delivery man (Hall) slips on a banana peel, meant for the fighter, a classic pie throwing scene results.", "labels": ["OCCUP_0", "PROTA_0"]}
{"text": "ID: 515\tTITLE: Feet First\tGENRE: Comedy\tPLOT: Ambitious shoe ________, ______, unknowingly meets the ____' daughter and tells her he is a leather tycoon. The rest of the film he spends hiding his true circumstances, in the store and later on a ship. Trying to deliver a letter, he later finds himself dangling high above the street on a building's scaffolding.", "labels": ["OCCUP_0", "PROTA_0", "OCCUP_1"]}
{"text": "ID: 39\tTITLE: The Mothering Heart\tGENRE: Short, Drama\tPLOT: A young couple struggle to get ahead, the wife always assuaging the troubles of her melancholy husband. As he climbs the ladder of success, he abandons the homely values and takes up with another woman. His wife leaves him, returning to her mother's home where she bears a child. When the husband is abandoned by his concubine, remorse drives him to find his wife...", "labels": []}
{"text": "ID: 594\tTITLE: Night Nurse\tGENRE: Comedy, Crime, Drama\tPLOT: _________ manages to land a job in a hospital as a trainee nurse. Upon completion of her training she goes to work as a night nurse for two small children who seem to be very sick, but something much more sinister is going on.", "labels": ["PROTA_0"]}
{"text": "ID: 104\tTITLE: A Night in the Show\tGENRE: Comedy, Short\tPLOT: Mr. ____ tries several theatre seats before winding up in front in a fight with the conductor. He is thrown out. In the lobby he pushes a fat lady into a fountain and returns to sit down by ____. Mr. _____, in the gallery, pours beer down on Mr. ____ and ____. He attacks patrons, a harem ______, the singers Dot and ____, and a fire-eater.", "labels": ["PROTA_0", "LOVE_0", "PROTA_1", "PROTA_0", "LOVE_0", "OCCUP_0", "PROTA_2"]}
{"text": "ID: 444\tTITLE: A Woman of Affairs\tGENRE: Drama\tPLOT: Even when _____, _______ and _____ played together as children, _____ knew that she loved ____. But ______, ____' father, did not like any _______. Since ____ did not have any money, ______ sent him off to _____ to work and also talked him out of marrying _____ before he left. _____ waited two years and then married _____, who ______ thought was the greatest thing since sliced bread. While in Paris, _____ jumps to his death when the ____ come after him and Diana lies about the reason for the sake of ______. Of course ______, who has been a drunk all his life, cuts all ties with _____. While ____ still loves _____, she does not return to _______ for seven years - just 3 days before Nevs' wedding to _________.", "labels": ["PROTA_0", "PROTA_1", "LOVE_0", "FLAT_0", "FLAT_1", "PROTA_2", "FLAT_1", "FLAT_2", "PROTA_3", "PROTA_2", "LOC_0", "LOVE_1", "FLAT_0", "LOVE_0", "PROTA_4", "LOVE_0", "OCCUP_0", "FLAT_3", "PROTA_4", "LOVE_1", "PROTA_3", "FLAT_0", "LOC_1", "LOC_2"]}
{"text": "ID: 251\tTITLE: Grandma's Boy\tGENRE: Comedy\tPLOT: When his roommate spends the rent money on hookers, ____, a 35 year old video game tester has to find a new place to live. After an \"encounter\" with his friend's mom, ____ is forced to move in with his grandmother. Trying to save face with his younger co-workers, ____ says that \"a really cute chick said I could sleep with her and her two crazy girlfriends\" (meaning his grandmother and her two roommates).", "labels": ["PROTA_0", "PROTA_0", "PROTA_0"]}
{"text": "ID: 160\tTITLE: Out West\tGENRE: Short, Western, Comedy\tPLOT: A satire of western movies. ______ comes into town after riding the rails. The saloon has a trap door over a pit where bodies are tossed as they are shot. A black patron is taunted and shot at. ______ and ______ do everything they can to keep __ from _____.", "labels": ["PROTA_0", "PROTA_0", "PROTA_1", "LOVE_0", "FLAT_0"]}
{"text": "ID: 581\tTITLE: The Last Flight\tGENRE: Drama\tPLOT: ____, ____, ____, and _______ are pilots who have just, and only just, survived the First World War. They linger in ______ in the aftermath, drinking and ostensibly having fun, but pessimistic and flip about their futures, as each feels himself somehow lost and dead inside as a result of the horrors he's experienced. They encounter a beautiful and vivacious girl, _____, and adopt her, not romantically but as a sort of mascot and light around which they can hover in hopes of regaining a sense of warmth and life. _____ does her best to reinvigorate her new friends, but despite the seeming lightheartedness of their escapades, the shadow of the war can never be dispelled.", "labels": ["FLAT_0", "PROTA_0", "FLAT_1", "PROTA_1", "LOC_0", "PROTA_2", "PROTA_2"]}
{"text": "ID: 116\tTITLE: Little Shop of Horrors\tGENRE: Comedy, Horror, Musical, Romance, Sci-Fi\tPLOT: ________________ is a nerdy orphan working at Mushnik's, a flower shop in urban Skid Row. He harbors a crush on fellow co-worker _______________, and is berated by Mr. _______ daily. One day as _______ is seeking a new mysterious plant, he finds a very mysterious unidentified plant which he calls _________. The plant seems to have a craving for blood and soon begins to sing for his supper. Soon enough, _______ feeds Audrey's sadistic dentist boyfriend to the plant and later, _______ for witnessing the death of Audrey's ex. Will _________ take over the world or will _______ and ______ defeat it?", "labels": ["PROTA_0", "FLAT_0", "PROTA_1", "PROTA_0", "FLAT_0", "PROTA_0", "PROTA_1", "FLAT_0", "FLAT_1", "LOVE_0"]}
{"text": "ID: 33\tTITLE: The New York Hat\tGENRE: Short, Drama\tPLOT: When Mrs. _______ dies, she leaves a mysterious letter to her pastor. The note tells how her cold, miserly husband worked her to death. She asks the pastor to administer a small trust which she has bequeathed her daughter so that the girl might enjoy some finery which her father has always denied her. The village milliner carries the latest hat styles from New York, one of which has caught the girl's fancy. The pastor, loyal to the dying mother's wishes, buys the young lady the hat. Soon gossip spreads through the village...", "labels": ["FLAT_0"]}
{"text": "ID: 430\tTITLE: Should Married Men Go Home?\tGENRE: Comedy, Short\tPLOT: When ______ visits _____ at home, hi-jinx occur and the Mrs. orders them out. They go to a golf course where they try to impress two young ladies and wind up in a mud-slinging fight with other golfers.", "labels": ["PROTA_0", "LOVE_0"]}
{"text": "ID: 58\tTITLE: Gertie the Dinosaur\tGENRE: Animation, Short, Comedy\tPLOT: Winsor Z. McCay bets another cartoonist that he can animate a dinosaur. So he draws a big friendly herbivore called ______. Then he get into his own picture. ______ walks through the picture, eats a tree, meets her creator, and takes him carefully on her back for a ride.", "labels": ["FLAT_0", "FLAT_0"]}
{"text": "ID: 162\tTITLE: Shoulder Arms\tGENRE: Comedy, War\tPLOT: _______ is in boot camp in the \"awkward squad.\" Once in ______ he gets no letters from home. He finally gets a package containing limburger cheese which requires a gas mask and which he throws over into the German trench. He goes \"over the top\" and captures thirteen Germans (\"I surrounded them\"), then volunteers to wander through the German lines disguised as a tree trunk. With the help of a French girl he captures __________ and ________________ and is given a statue and victory parade in New York and then ... fellow soldiers wake him from his dream.", "labels": ["PROTA_0", "LOC_0", "ANTAG_0", "FLAT_0"]}
{"text": "ID: 191\tTITLE: Leaves From Satan's Book\tGENRE: Drama\tPLOT: After seeing D. W. Griffith's epic Intolerance, Denmark's greatest ________, ____________ ______ (The Passion of ____ of Arc, ______), was inspired to make his own four-episode historical epic with each story told end to end, anthology-style, linked by theme to the others. The unifying character, Satan, attempts to win God's favor but is doomed to cheerless participation in dark episodes of human history: the temptation of Jesus, the Spanish Inquisition, the French Revolution and the Russo-Finnish war of 1918. Few directors resisted compromise and convention the way ______ did; fortunately, the Nordisk Film Company was artistically progressive by _________ standards and agreed that this should be a prestige film made to the highest standards. More than two years in production, ______ not only directed but also controlled every facet of this ambitious production.", "labels": ["OCCUP_0", "FLAT_0", "FLAT_1", "LOVE_0", "FLAT_2", "FLAT_1", "LOC_0", "PROTA_0"]}
{"text": "ID: 468\tTITLE: The Iron Mask\tGENRE: Adventure, Drama, History, Romance\tPLOT: King Louis XIII of ______ is thrilled to have born to him a son - an heir to the throne. But when the queen delivers a twin, __________________ sees the second son as a potential for revolution, and has him sent off to _____ to be raised in secret to ensure a peaceful future for ______. Alas, keeping the secret means sending _________, lover of __________, off to a convent. __________ hears of this and rallies the Musketeers in a bid to rescue her. Unfortunately, _________ out-smarts the Musketeers and banishes them forever. _________ enlists __________ to look after and protect the young prince. Meanwhile, de Rochefort learns of the twins and _________'s plans, and kidnaps the twin, raising him in secret. Many years later, with _________ dead and the young prince crowned __________ XIV, _________ launches his plan. The king is kidnapped, replaced with his twin, put in an iron mask so as not to be recognized, and led off to a remote castle to be held prisoner. Louis XIV is able to alert __________, who realizes that only his friends _____, _______, and ______ can help him, so he reunites the Musketeers to derail _________'s nefarious plot but at a heavy toll.", "labels": ["LOC_0", "ANTAG_0", "LOC_1", "LOC_0", "ANTAG_1", "PROTA_0", "PROTA_0", "ANTAG_0", "ANTAG_0", "PROTA_0", "ANTAG_0", "ANTAG_0", "FLAT_0", "PROTA_1", "PROTA_0", "FLAT_1", "FLAT_2", "FLAT_3", "OCCUP_0"]}
{"text": "ID: 343\tTITLE: The Lodger: A Story of the London Fog\tGENRE: Crime, Drama, Mystery, Thriller\tPLOT: A _____________ known as \"The Avenger\" is on the loose in ______, murdering blonde women. A mysterious man arrives at the house of Mr. and Mrs. _______ looking for a room to rent. The Bunting's daughter is a blonde model and is seeing one of the detectives assigned to the case. The detective becomes jealous of the lodger and begins to suspect he may be the avenger.", "labels": ["OCCUP_0", "LOC_0", "FLAT_0"]}
{"text": "ID: 578\tTITLE: Illicit\tGENRE: Drama, Romance\tPLOT: ___, a young lady of scandalously \"advanced\" ideas, has been living in near-sin with blueblood lover ____, due to her conviction that marriage will destroy their love. Finally, social pressure forces them to marry; in due course, it looks as if ___ was right. Her solution: to separate and return to dating. Can this marriage be saved?", "labels": ["PROTA_0", "FLAT_0", "PROTA_0"]}
{"text": "ID: 609\tTITLE: The Secret 6\tGENRE: Crime, Drama\tPLOT: Bootlegger/cafe owner Ralph Bellamy recruits crude working man Wallace Beery to join his gang which is masterminded by crooked criminal defense ______ ___________. _____ eventually takes over Bellamy's operation, beats a rival gang, becomes wealthy and dominates the city for several years until a secret group of 6 masked businessmen have him prosecuted and sent to the electric chair with the help of rival crusading newspapermen ___________ and _________________. Waitress ___________ is torn between her love for the honest _______ _____ and her financial dependence on her generous boss, _____.", "labels": ["OCCUP_0", "PROTA_0", "PROTA_1", "PROTA_2", "PROTA_3", "PROTA_4", "OCCUP_1", "PROTA_3", "PROTA_1"]}
{"text": "ID: 518\tTITLE: Free and Easy\tGENRE: Comedy, Musical\tPLOT: __________________ hosts a beauty contest. The winner, _______________, and her mother go to _________. The Chamber of ________ also provides ______ with an agent, ___________'s own _____ _______. _____ likes ______ and the shy ______ likes him, but Mrs. ________, a formidable woman, has little use for hapless _____. On the train west, they meet movie star ______________, who takes a shine to ______ and helps her meet MGM directors once they get to ___________. _____, meanwhile, wants to help ______ with her career and he also wants to be her man. Movie stardom does come to the ___________ entourage, but to whom is a surprise. And who will win the lovely ______'s hand?", "labels": ["LOC_0", "PROTA_0", "LOC_1", "LOC_2", "LOVE_0", "LOC_0", "PROTA_1", "LOVE_1", "PROTA_1", "PROTA_0", "PROTA_0", "FLAT_0", "PROTA_1", "LOVE_2", "FLAT_1", "LOC_3", "PROTA_1", "PROTA_0", "LOC_0", "PROTA_0"]}
{"text": "ID: 224\tTITLE: The Idle Class\tGENRE: Short, Comedy\tPLOT: The conflict here is between _______ the wealthy and alcoholic husband and _________________: the idle rich and the idle poor. In the opening scene wealthy ____ descends from a _______ car while the Tramp crawls out from under another one. At a fancy masquerade ball ____'s husband appears as a ______ whose visor is stuck closed. _________ shows up, running from the law, and is mistaken for the husband. ____ finds the new \"husband\" more to her liking than the real one. When true identities are revealed, a fight breaks out and _________ is ejected.", "labels": ["PROTA_0", "PROTA_0", "LOVE_0", "LOC_0", "LOVE_0", "OCCUP_0", "PROTA_0", "LOVE_0", "PROTA_0"]}
{"text": "ID: 177\tTITLE: Don't Change Your Husband\tGENRE: Comedy\tPLOT: ____________ comes to dislike her husband _____, a glue king who is always eating onions and looking sloppy. But after she divorces him and marries two-timing playboy ________ ___________ the now-reformed _____ looks pretty good.", "labels": ["PROTA_0", "PROTA_1", "ANTAG_0", "ANTAG_1", "PROTA_1"]}
{"text": "ID: 86\tTITLE: Oh, What a Night\tGENRE: Comedy\tPLOT: In a small Canadian township two lads start to investigate the world of women, with some advice from the local Scottish shop and garage owner. One of them tries to impress his girl with his dad's various cars while the other takes an increasingly serious interest in an older woman. Meanwhile the parents involved have their own adult problems.", "labels": []}
{"text": "ID: 585\tTITLE: Murderers Among Us\tGENRE: Drama, Romance, Thriller, War\tPLOT: Susanne _______ returns to the ruins of ______ from a Concentration Camp after WW2 to discover that someone else lives in her apartment: Dr. ____________, the war made him depressive and he drinks a lot of alcohol. _______ asks him to go but he doesn't want to, so they share Susanne's apartment and even discover their sympathy and then their love for each other. That encourages him a little, of course. But then he hears that __________________ is still alive and also lives in ______. ________ was his Captain during WW2, he gave the order to kill more than 100 innocent people, many children and women among them, on _________ 1942 in ______.", "labels": ["PROTA_0", "LOC_0", "PROTA_1", "PROTA_2", "PROTA_3", "LOC_0", "FLAT_0", "LOC_1", "LOC_2"]}
{"text": "ID: 167\tTITLE: Auction of Souls\tGENRE: Drama, History, Romance\tPLOT: Aurora Mardiganian, a young and beautiful Armenian girl, lives with her parents in the Turkish city of _______. Her father, a prosperous ________, was preparing to send her to the West to be educated. For centuries the Armenians had been terrorized by the Turks, but this was a period of serenity between the Turks and the Christian-Armenians. However, the War had hit ______, and the Turks had informed the American ambassador, _____ ___________ in Constantinople, that the Armenians were giving support to the Turks' enemy, ______. Despite Morgantheau's objections, the Turks issue a decree that the Armenians must be moved southward into the desert. The Turkish governor, a Pasha, comes to Aurora's father and demands she be given him as a bride. The father tells him his daughter will not give up her Christian belief, as she would have to do to marry a Muslim. The governor leaves in anger. The order is given for the removal of the Armenians. The men are separated from the women, and the Armenian soldiers are forced to disrobe and dig a trench, and then are shot down by the Turks. Mothers are torn away from their children and the Armenians are marched away into the desert where, famine, thirst and fierce heat await them. Aurora escapes to a mission school ran by ____________, an English girl. The Turk soldiers surround the school and Miss ______ protests under the protection of the English flag to no avail,as the Turks trample the flag, and the Armenian girls are dragged away. Miss ______, determined to help the girls as much as she possibly can, disguises herself as one of them and joins the march.", "labels": ["LOC_0", "OCCUP_0", "LOC_1", "FLAT_0", "LOVE_0", "LOC_2", "FLAT_1", "PROTA_0", "PROTA_0"]}
{"text": "ID: 453\tTITLE: The Broadway Melody\tGENRE: Drama, Musical, Romance\tPLOT: Harriet and _______________, a vaudeville act, come to ________, where their friend ___________ needs them for his number in one of ________________'s shows. _____ was in love with _______, but when he meets _______, he falls in love to her, but she is courted by _____________, a member of the New Yorker high society. It takes a while till _______ recognizes, that she is for ____ nothing more than a toy, and it also takes a while till _______ recognizes, that _____ is in love with _______.", "labels": ["FLAT_0", "LOC_0", "PROTA_0", "PROTA_1", "PROTA_0", "LOVE_0", "PROTA_2", "FLAT_1", "PROTA_2", "PROTA_3", "PROTA_4", "PROTA_0", "LOVE_1"]}
{"text": "ID: 72\tTITLE: _____ at the Wheel\tGENRE: Short, Comedy\tPLOT: _______, competing with his rival's race car, offers _____ a ride on his motorcycle but drops her in a puddle. He next joins some dubious characters in abduction of his rival just before the race for the ______________. With her boyfriend locked up in a shed, _____ takes his place. _______ does what he can to sabotage the race, even causing _____'s car to overturn.", "labels": ["LOVE_0", "PROTA_0", "PROTA_1", "LOC_0", "LOVE_0", "PROTA_0", "LOVE_0"]}
{"text": "ID: 273\tTITLE: Souls for Sale\tGENRE: Comedy, Drama, Romance\tPLOT: On board a train en route to ___________, runaway bride Remember Steddon, believing now that she married in haste, abandons her husband, ____________, not knowing at the time that Scudder had previously married and murdered solely for money. Unprepared to be on her own, Mem, as she is known to her friends, accidentally stumbles across the outdoor set of a _________ movie directed by ______________. Mem is welcomed onto the set by the cast and crew. But as the shooting moves on, Mem decides to pursue other avenues, as she had been taught by her conservative parents that movie acting was a disreputable occupation. But needing work, ___ decides to try her hand at being an _______. This task is easier said than done, until she runs across ________ again, he who is determined to make her a star. As her movie stardom does indeed rise, so does the admiration of adoration of legions, including her director ________, and her leading man _________. A further consequence of her stardom is that her parents and _______ find out where she is. The scandal of being married to a known murderer may jeopardize Mem's budding career.", "labels": ["LOC_0", "FLAT_0", "LOC_1", "FLAT_1", "PROTA_0", "OCCUP_0", "PROTA_1", "LOVE_0", "PROTA_2", "PROTA_3"]}
{"text": "ID: 425\tTITLE: The Mysterious Lady\tGENRE: Drama, Romance\tPLOT: In ______, in the beginning of the Twentieth Century, Captain ____ von _____ and his partner Captain ____________ learn in the box office that the ticket for the opera is sold-out. Out of the blue, a man returns his ticket and ____ buys it and shares a box with a gorgeous woman that is waiting for her cousin. ____ gives a ride home to the lady and they spend the night together. On the next day, they spend a wonderful day in the countryside together. ____ is assigned to travel to ______ by train to deliver secret plans to the German government. His uncle, ______________________, who is the chief of the Austrian secret service, advises ____ the woman with whom he had spent the previous day is the notorious Russian spy ______________. While in the train, _____ meets ____ to tell that she is in love with him, but he rejects her telling that he knows who she is. On the next morning, ____ wakes up and finds that the plans have been stolen and he receives a message from _____ telling that she came as a woman in love with him and left as his enemy. ____ is expelled and imprisoned by the army as traitor but his uncle offers him the chance to clean his name, traveling to ______ to find who the traitor is. ____ poses as _______ and meets _____ and her lover, the powerful _________________________. What will ____ and _____ do?", "labels": ["LOC_0", "PROTA_0", "FLAT_0", "PROTA_1", "PROTA_0", "PROTA_0", "PROTA_0", "LOC_1", "PROTA_2", "FLAT_1", "LOVE_0", "PROTA_3", "PROTA_0", "PROTA_0", "PROTA_3", "PROTA_0", "LOC_2", "PROTA_0", "OCCUP_0", "PROTA_3", "FLAT_2", "PROTA_0", "LOVE_0"]}
{"text": "ID: 263\tTITLE: The Balloonatic\tGENRE: Short, Comedy\tPLOT: ______ and _______ endure a number of outdoor adventures trying to prove to each other their survival skills. The balloon which lands ______ in the wilderness proves useful later on as their canoe is about go over a waterfall.", "labels": ["PROTA_0", "PROTA_1", "PROTA_0"]}
{"text": "ID: 282\tTITLE: Girl Shy\tGENRE: Comedy, Romance\tPLOT: ______________ (_____) is a shy, stuttering bachelor working in a ______ shop, who is writing a guide book for other bashful young men, \"The Secret of Making Love,\" chapters from which are portrayed as fantasy sequences. Fate has him meet rich girl, ____ (_______), and they fall in love. But she is about to wed an already married man, so our hero embarks upon a hair-raising daredevil ride to prevent the wedding.", "labels": ["PROTA_0", "PROTA_1", "OCCUP_0", "LOVE_0", "PROTA_2"]}
{"text": "ID: 38\tTITLE: Fantômas: The Dead Man Who Killed\tGENRE: Crime, Drama, Mystery\tPLOT: After a body disappears from inside the prison, a series of crimes take place, all seemingly by the dead man. With Juve presumed dead, ______ must investigate alone. Will ________ finally be brought to justice?", "labels": ["FLAT_0", "PROTA_0"]}
{"text": "ID: 164\tTITLE: Stella Maris\tGENRE: Drama\tPLOT: ____________ is a beautiful, crippled girl, who is cared for by a rich family. They shield her from the harsh realities of the world, so that she has no idea of the cruel things that some people do. ___________ is a poor orphan all too familiar with the harsh realities of the real world. These two young women both fall in love with ____, love which is complicated by the fact that he is still married to (though separated from) a bad wife.", "labels": ["PROTA_0", "FLAT_0", "ANTAG_0"]}
{"text": "ID: 203\tTITLE: One Week\tGENRE: Adventure, Drama\tPLOT: Out of the blue, ___ learns he has stage IV cancer; survival, with treatment, is 10 percent. So this risk-averse, slow-to-act, quiet man buys a used motorcycle, says goodbye to ________, his baffled fiancée, and heads west from _______. He imagines it's a quest for ______, a mythical figure from his childhood; he takes digital photos of various \"world's largest\" roadside attractions; he chats with strangers, including two women; his bike slips on a dead skunk on the highway. Calls to ________ meet with pleading that he return for treatment and anger that he won't. He doesn't want to be a patient yet. But, will he make discoveries, and what about ______? What's important?", "labels": ["PROTA_0", "LOVE_0", "LOC_0", "ANTAG_0", "LOC_1", "FLAT_0"]}
{"text": "ID: 595\tTITLE: One Good Turn\tGENRE: Short, Comedy\tPLOT: ____ and _____ are down on their luck and beg at an old lady's house for food. While they are eating they overhear a villainous landlord (Finlayson) threatening to evict her if she does not pay the mortgage. Not realizing that they are hearing a rehearsal for a play, the boys decide to auction their car to help. In the confusion surrounding the auction, ____ finds himself in possession of a fat wallet and _____ accuses him of stealing the old lady's money. When the truth is revealed, ____ exacts painful retribution.", "labels": ["PROTA_0", "PROTA_1", "PROTA_0", "PROTA_1", "PROTA_0"]}
{"text": "ID: 538\tTITLE: Romance\tGENRE: Drama\tPLOT: Although deeply in love with her boyfriend - and indeed sleeping in the same bed with him - a _____________ cannot handle the almost complete lack of intimacy he will allow. Increasingly frustrated, she gradually finds her sexual appetites leading her into ever more risky situations, including a developing one with the headmaster.", "labels": ["OCCUP_0"]}
{"text": "ID: 15\tTITLE: The Red Spectre\tGENRE: Short, Fantasy\tPLOT: In a strange grotto deep in the bowels of the earth a coffin uprights itself, dances, then opens, and out steps a demonic ________ with skeletal face, horns, and cape. He wraps two women (who appear to be in a trance) in fabric, levitates them, and causes them to burst into flames and disappear. As he gathers their ashes in a pitcher a Good Spirit [a young woman who resembles _________] appears, shakes her head No, and reveals the \"souls\" of the two women in a secret compartment deeper within the cave. The Good Spirit vanishes in a puff of smoke. The ________ then produces 3 glass bottles on pillars, takes them downstage close to the camera, and reveals 3 tiny women in them; one woman beats a tambourine while the other two sway. The ________ pours ashes (?) into the bottles, but the Good Spirit reappears and makes these trapped figures disappear in a flash, angering the ________, who chases her away. He makes an easel appear. There is an odd sort of screen on it bearing the Pathe rooster logo. The ________ then invents channel-surfing, causing three different \"shows\" to appear on the screen in rapid succession. The Good Spirit reappears and causes this strange television set to vanish, but the ________ creates two more in turn, each more elaborate than the last, with various images of persons and dogs flashing across their screens. Finally, the Good Spirit reveals to the evil magician an area within the cave where there are four pillars and a tableau of distinguished-looking ladies (goddesses?). She takes the magician downstage, forces him to the ground, pours a pitcher of something on him (ashes? Holy water?) and turns him into a lifeless skeleton, which she reveals to the camera. Three tall flames appear in the foreground, and the film is over.", "labels": ["OCCUP_0", "PROTA_0", "OCCUP_0", "OCCUP_0", "OCCUP_0", "OCCUP_0", "OCCUP_0"]}
{"text": "ID: 499\tTITLE: Anna Christie\tGENRE: Drama, Romance\tPLOT: In ________, the alcoholic skipper of a coal barge ____________________ receives a letter from his estranged twenty year old daughter ____ \"________\" Christofferson telling that she will leave _________ to stay with him. _____ left ____ fifteen years ago to the countryside to be raised by relatives in a farm in St. ____ and he has never visited his daughter. _____________ arrives and she is a wounded woman with a hidden dishonorable past since she had worked for two years in a brothel to survive. She moves to the barge to live with her father and one night, _____ rescues the sailor ____ and two other fainted sailors from the sea. Soon ____ and ____ fall in love with each other and ____ has the best days of her life. But when ____ proposes to marry her, she is reluctant and also haunted by her past. ____ insists and ____ opens her heart to ____ and to her father disclosing the darks secrets of her past.", "labels": ["LOC_0", "PROTA_0", "LOVE_0", "LOVE_1", "LOC_1", "PROTA_0", "PROTA_1", "FLAT_0", "PROTA_1", "PROTA_0", "PROTA_2", "PROTA_1", "PROTA_2", "PROTA_1", "PROTA_2", "PROTA_2", "PROTA_1", "PROTA_2"]}
{"text": "ID: 159\tTITLE: Moonshine\tGENRE: Comedy, Short\tPLOT: A feud between the Owens and the Gillettes ends when the last remaining ________ is killed, but new trouble erupts for the mountain folk with the arrival of a ____ revenue agent and his _________. The revenuers search high and low for the secret hideaway where the mountain people prepare illegal alcohol, but end up in deep trouble that only a little movie magic can save them from.", "labels": ["PROTA_0", "LOC_0", "OCCUP_0"]}
{"text": "ID: 451\tTITLE: Berth Marks\tGENRE: Short, Comedy\tPLOT: Big-time (so they think) vaudeville stars _______ and ______ take the train to __________, their next booking. On board, they bumble into the wrong sleeping compartment, startling a semi-dressed woman. Her irate husband mistakes another passenger for the intruder and starts a coat-ripping free- for-all. The boys spend the rest of the trip trying to squeeze themselves into their cramped single upper berth.", "labels": ["PROTA_0", "PROTA_1", "LOC_0"]}
{"text": "ID: 612\tTITLE: The Star Witness\tGENRE: Drama\tPLOT: The _____ family is thrown right in the middle of a war between the ____ and gangland when they are the only witnesses to two murders committed by gang kingpin ____________. Initially positive in their identification of the murderer, their attitudes change when young ___________ is kidnapped by Campos' boys. No amount of threatening with perjury by _____________ can get them to tell the truth - except for cantankerous old _______, civil war veteran, who berates his family for failing to do their civic duty, whatever the cost. Though having his doubts as to the credibility of his star witness, ________ is nevertheless taken aback when he learns _______ has disappeared just before he is to testify.", "labels": ["FLAT_0", "OCCUP_0", "FLAT_1", "PROTA_0", "FLAT_2", "FLAT_3", "PROTA_1", "PROTA_2"]}
{"text": "ID: 126\tTITLE: Solo\tGENRE: Action, Sci-Fi, Thriller\tPLOT: _________________ stars as an android killing weapon designed by the military and utilized to enter into a Latin American war to destroy the rebels - natives fighting simply to maintain their freedom. Contrary to his programming, he develops an affinity for the villagers and decides to help them fight back. This lets his creators bring him back and ultimately leads to one of them being given more powerful circuitry to defeat him.", "labels": ["PROTA_0"]}
{"text": "ID: 304\tTITLE: Battleship Potemkin\tGENRE: Drama, History, Thriller\tPLOT: Based on the historical events the movie tells the story of a riot at the battleship ________. What started as a protest strike when the crew was given rotten meat for dinner ended in a riot. The sailors raised the red flag and tried to ignite the revolution in their home port ______.", "labels": ["LOC_0", "FLAT_0"]}
{"text": "ID: 391\tTITLE: The Student Prince in Old Heidelberg\tGENRE: Drama, Romance\tPLOT: Young Prince _____________ has spent his entire life behind the palace gates protected from the world. He has been raised in a melancholy atmosphere of strict discipline and duty, yet he often looks out at the frolics of youths and maidens who live beyond the walls. When he passes his exams, ____ is sent to __________ to complete his studies. It is a heady new world of brew, song, and comradeship. ____ falls in love with _____, a pretty barmaid, and she reciprocates. But can the love survive their disparate backgrounds? Will ____ ever find happiness or will duty deny it to him?", "labels": ["PROTA_0", "PROTA_0", "LOC_0", "PROTA_0", "LOVE_0", "PROTA_0"]}
{"text": "ID: 199\tTITLE: The Mark of Zorro\tGENRE: Action, Adventure, Romance, Western\tPLOT: Around 1820 the son of a __________ nobleman comes home from _____ to find his native land under a villainous dictatorship. On the one hand he plays the useless fop, while on the other he is the masked _______ _____.", "labels": ["LOC_0", "LOC_1", "OCCUP_0", "FLAT_0"]}
{"text": "ID: 569\tTITLE: Drácula\tGENRE: Fantasy, Horror\tPLOT: At midnight on Walpurgis Night, an English _____, ________, arrives at Count _______'s castle in the ____________________. After signing papers to take over a ruined abbey near ______, _______ drives ________ mad and commands obedience. ________ escorts the boxed count on a death ship to ______. From there, the Count is introduced into the society of his neighbor, Dr. ______, who runs an asylum. _______ makes short work of family friend, ____________, then begins his assault on __________, the doctor's daughter. A visiting expert in the occult, ___________, recognizes _______ for who he is, and there begins a battle for Eva's body and soul.", "labels": ["OCCUP_0", "FLAT_0", "PROTA_0", "LOC_0", "LOC_1", "PROTA_0", "FLAT_0", "FLAT_0", "LOC_1", "FLAT_1", "PROTA_0", "LOVE_0", "LOVE_1", "ANTAG_0", "PROTA_0"]}
{"text": "ID: 285\tTITLE: The Iron Horse\tGENRE: History, Romance, Western\tPLOT: Springfield, ________. _______, a ________, dreams of building a railway to the west, but _____, a contractor, is sceptical. Abraham Lincoln looks on as their children, ____________ and ____________, play together. _______ sets off with ____ to survey a route. They discover a new pass which will shave 200 miles off the expected distance, but they are set upon by a party of ________. One of them, a white renegade with only two fingers on his right hand, kills _______ and scalps him. ____ buries his father... Years pass. It is 1862 and _______ signs the bill authorizing construction of the __________________________________________. _____ is principal contractor and ______ is engaged to ______, the chief engineer... Crews of Chinese, Italians, and Irish work to build the railway while resisting Indian attack. When the pay train is delayed by Indian ambush, the Italians go on strike. ______ persuades them to return to work... Marsh needs to find a shortcut through the Black Hills. To finish on time, he needs to shorten the route by 200 miles. ______, the biggest __________, wants the route to stay the same - through his land. _____ has entrusted ______ with finding the new route. ______ has ____, a saloon girl, persuade ______ to do otherwise... ____, now a pony express rider, recalls his father's discovery. He sets off to find the pass. He goes alone, except for Jesson...", "labels": ["LOC_0", "PROTA_0", "OCCUP_0", "LOVE_0", "PROTA_0", "PROTA_1", "PROTA_0", "FLAT_0", "LOC_1", "PROTA_0", "PROTA_0", "PROTA_2", "LOC_2", "PROTA_1", "PROTA_1", "LOVE_1", "PROTA_1", "PROTA_3", "OCCUP_1", "PROTA_1", "LOC_3", "PROTA_3", "PROTA_4", "PROTA_5", "PROTA_0"]}
{"text": "ID: 325\tTITLE: Variety\tGENRE: Crime, Drama, Romance\tPLOT: Prologue: The murderer \"____\" ______ - after having spent ten years in prison - breaks his silence to tell the warden his story. \"____\", a former ______________, and his wife own a cheap ...", "labels": ["FLAT_0", "FLAT_1", "FLAT_0", "OCCUP_0"]}
{"text": "ID: 462\tTITLE: The Great Gabbo\tGENRE: Drama, Musical, Romance\tPLOT: An insanely, egocentric _____________, even though he is possessed by his wooden dummy, is in love with a ______ who is in love with another. The dummy gives advice to the ventriloquist.", "labels": ["OCCUP_0", "OCCUP_1"]}
{"text": "ID: 488\tTITLE: Old and New\tGENRE: Drama\tPLOT: 100.000.000 peasants - illiterate, poor, hungry. There comes a day when one woman decides that she can live old life no longer. Using ways of new Soviet state and industrial progress she changes life and labor of her village.", "labels": []}
{"text": "ID: 132\tTITLE: Run, Waiter, Run!\tGENRE: Comedy\tPLOT: A comedy concerning a down on his luck bookshop owner with a penchant for women who decides to make some money by pretending to be a ______ and collecting cash from unsuspecting diners.", "labels": ["OCCUP_0"]}
{"text": "ID: 214\tTITLE: Among Those Present\tGENRE: Comedy, Short\tPLOT: Mrs. _______ is eager to be accepted as part of high society, and she is hosting a fox hunt as part of her plans. Her husband and daughter, though, have no interest in society affairs. Mrs. _______ wants to invite Lord _________ to the hunt, and she mentions this to the 'society pilot' who is advising her. But this woman and a confederate are merely using Mrs. _______ and the hunt for their own purposes. When Lord _________ is unavailable, they convince an ambitious young man to impersonate him, so that they can proceed with their scheme.", "labels": ["FLAT_0", "LOVE_0", "PROTA_0", "FLAT_0", "PROTA_0"]}
{"text": "ID: 260\tTITLE: Sherlock Holmes\tGENRE: Action, Adventure, Crime, Mystery, Thriller\tPLOT: After finally catching _____________ and occult \"________\" Lord Blackwood, legendary sleuth Sherlock Holmes and his assistant Dr. Watson can close yet another successful case. But when _________ mysteriously returns from the grave and resumes his killing spree, ______ must take up the hunt once again. Contending with his partner's new fiancée and the dimwitted head of Scotland Yard, the dauntless detective must unravel the clues that will lead him into a twisted web of murder, deceit, and black magic - and the deadly embrace of temptress ___________.", "labels": ["OCCUP_0", "OCCUP_1", "PROTA_0", "PROTA_1", "FLAT_0"]}
{"text": "ID: 210\tTITLE: Why Change Your Wife?\tGENRE: Comedy, Drama\tPLOT: ______ and ___________ are married but share little. He runs into Sally at a cabaret and the _______ are soon divorced. Just as he gets bored with Sally's superficiality, ____ strives to improve her looks. The original couple falls in love again at a summer resort.", "labels": ["FLAT_0", "PROTA_0", "PROTA_1", "PROTA_0"]}
{"text": "ID: 274\tTITLE: The Ten Commandments\tGENRE: Adventure, Drama\tPLOT: To escape the edict of Egypt's Pharaoh, Rameses I, condemning all newborn Hebrew males, the infant Moses is set adrift on the Nile in a reed basket. Saved by the pharaoh's daughter _______, he is adopted by her and brought up in the court of her brother, ____________. _____ gains Seti's favor and the love of the throne princess _________, as well as the hatred of Seti's son, _______. When his Hebrew heritage is revealed, _____ is cast out of _____, and makes his way across the desert where he marries, has a son and is commanded by ___ to return to _____ to free the _______ from slavery. In _____, _____' fiercest enemy proves to be not _______, but someone near to him who can 'harden his heart'.", "labels": ["FLAT_0", "FLAT_1", "PROTA_0", "LOVE_0", "FLAT_2", "PROTA_0", "LOC_0", "PROTA_1", "LOC_0", "ANTAG_0", "LOC_0", "FLAT_3", "FLAT_2"]}
{"text": "ID: 407\tTITLE: The Circus\tGENRE: Comedy, Romance\tPLOT: _________ finds himself at a circus where he is promptly chased around by the police who think he is a pickpocket. Running into the Bigtop, he is an accidental sensation with his hilarious efforts to elude the police. The circus _____ immediately hires him, but discovers that the Tramp cannot be funny on purpose, so he takes advantage of the situation by making the Tramp a _______ who just happens to always be in the Bigtop at showtime. Unaware of this exploitation, the Tramp falls for the owner's lovely acrobatic stepdaughter, who is abused by her father. His chances seem good, until a dashing rival comes in and _______ feels he has to compete with him.", "labels": ["PROTA_0", "OCCUP_0", "OCCUP_1", "PROTA_1"]}
{"text": "ID: 531\tTITLE: Night Owls\tGENRE: Comedy, Drama\tPLOT: After workaholic _____ has a drunken one night stand with the beautiful train-wreck ________, he's horrified to discover that she's actually his boss' jilted ex-mistress. When she takes a bottle of sleeping pills, _____ is forced to keep her awake... and over the course of the night the two begin to fall for each other.", "labels": ["PROTA_0", "LOVE_0", "PROTA_0"]}
{"text": "ID: 50\tTITLE: Caught in the Rain\tGENRE: Short, Comedy\tPLOT: When a married couple become separated in the park, _______ takes up with the lady and is beat up when her husband rejoins her. He takes a room in their hotel, and she sleepwalks into his room so that when her husband returns from his walk he must go out again to look for her. _______ returns the lady to her room but must climb out onto the window ledge in a downpour.", "labels": ["PROTA_0", "PROTA_0"]}
{"text": "ID: 512\tTITLE: The Dawn Patrol\tGENRE: War, Drama\tPLOT: In 1915 ______, Major Brand commands the 39th Squadron of ______________________. The young airmen go up in bullet-riddled \"crates\" and the casualty rate is appalling, but Brand can't make the \"brass hats\" at headquarters see reason. Insubordinate air ace Captain ________ is another thorn in Brand's side...but finds the smile wiped from his face when he rises to command the squadron himself. Everyone keeps a stiff upper lip.", "labels": ["LOC_0", "LOC_1", "PROTA_0"]}
{"text": "ID: 529\tTITLE: Monte Carlo\tGENRE: Adventure, Comedy, Family, Romance\tPLOT: A young woman, her uptight step sister and her best friend use their savings for a long anticipated dream trip to _____, which turns out to be a big disappointment. When they decide to take a break from their lousy tour and duck into the lobby of a luxury hotel, one of them is mistaken for a spoiled British heiress. Before they get the chance to reveal their true identities they are wrapped up in misadventures during a vacation to ___________ instead.", "labels": ["LOC_0", "LOC_1"]}
{"text": "ID: 423\tTITLE: Solitude\tGENRE: Drama\tPLOT: Soledad is an ______ who has with drawn from society by moving into the desert. She lives a life alone seemingly immersed in noticing and painting the beauty that shes sees. Somewhere ...", "labels": ["OCCUP_0"]}
{"text": "ID: 240\tTITLE: Beauty's Worth\tGENRE: Drama, Romance\tPLOT: Prudence Cole is an unsophisticated Quaker girl being raised by her two aunts. ________ is flirted with by snobbish ______________, who actually disdains the girl for her lack of worldliness and savoir faire. When _____ and his friends try to embarrass her at a posh resort, ________ turns the tables on them.", "labels": ["PROTA_0", "FLAT_0", "FLAT_0", "PROTA_0"]}
{"text": "ID: 204\tTITLE: The Penalty\tGENRE: Crime, Drama, Horror\tPLOT: Blizzard, deranged from a childhood operation in which both his legs were perhaps needlessly amputated after an accident, becomes a vicious criminal, and eventually mob leader of the _____________ underworld. Out for revenge against the _______ who performed his operation, he undergoes brain surgery which has a chance of altering his anti-social behavior.", "labels": ["LOC_0", "OCCUP_0"]}
{"text": "ID: 89\tTITLE: Tango Tangle\tGENRE: Short, Comedy\tPLOT: Out of costume, _______ is a clean-shaven dandy who, somewhat drunk, visits a dance hall. There the wardrobe girl has three rival admirers: the band leader, one of the musicians, and now _______.", "labels": ["PROTA_0", "PROTA_0"]}
