{"text": "ID: 515\tTITLE: Feet First\tGENRE: Comedy\tPLOT: Ambitious shoe ________, ______, unknowingly meets the ____' daughter and tells her he is a leather tycoon. The rest of the film he spends hiding his true circumstances, in the store and later on a ship. Trying to deliver a letter, he later finds himself dangling high above the street on a building's scaffolding.", "labels": ["OCCUP_0", "PROTA_0", "OCCUP_1"]}
{"text": "ID: 516\tTITLE: The Florodora Girl\tGENRE: Drama, Musical, Romance\tPLOT: A chorus girl gets bad advice from her fellow chorines in handling a rich suitor who assumes she is a gold-digger. But she assumes he is after \"one thing\" and is holding out for marriage. After meeting his mother, she learns that her beau is engaged to a society girl. He loses his money and they drift apart. But after making a new fortune, he comes to the theater.", "labels": []}
{"text": "ID: 517\tTITLE: Easy Come, Easy Go\tGENRE: Adventure, Comedy, Music\tPLOT: Navy frogman, ___________ (_____________), balances his time between twin careers as a deep sea diver and nightclub ______. During a dive, ___ spots sunken treasure and returns with hope to retrieve it.", "labels": ["PROTA_0", "PROTA_1", "OCCUP_0", "PROTA_2"]}
{"text": "ID: 518\tTITLE: Free and Easy\tGENRE: Comedy, Musical\tPLOT: __________________ hosts a beauty contest. The winner, _______________, and her mother go to _________. The Chamber of ________ also provides ______ with an agent, ___________'s own _____ _______. _____ likes ______ and the shy ______ likes him, but Mrs. ________, a formidable woman, has little use for hapless _____. On the train west, they meet movie star ______________, who takes a shine to ______ and helps her meet MGM directors once they get to ___________. _____, meanwhile, wants to help ______ with her career and he also wants to be her man. Movie stardom does come to _________________________, but to whom is a surprise. And who will win the lovely ______'s hand?", "labels": ["LOC_0", "PROTA_0", "LOC_1", "LOC_2", "LOVE_0", "LOVE_1", "PROTA_1", "LOVE_2", "PROTA_1", "PROTA_2", "PROTA_2", "PROTA_3", "PROTA_1", "ANTAG_0", "FLAT_0", "LOC_3", "PROTA_1", "LOVE_0", "LOC_4", "PROTA_2"]}
{"text": "ID: 519\tTITLE: The Girl Said No\tGENRE: Comedy, Romance\tPLOT: ________ is just back from _______ and the only thing that he seemed to learn is how to be obnoxious and loud. He forgoes a bank job to work at ______ and Company just to make time with ____, McAndrews' fiancée. ____ warms to ___, but his work is such that his job is history. After losing his father, it is up to ___ to support and care for his family. His attitude towards work changes, but not his attitude towards ____.", "labels": ["PROTA_0", "LOC_0", "LOC_1", "LOVE_0", "PROTA_1", "LOVE_1", "LOVE_1", "LOVE_0"]}
{"text": "ID: 520\tTITLE: Hell's Angels\tGENRE: Drama, War\tPLOT: Two brothers attending ______ enlist with the RAF when World War I breaks out. ___ and ______________ have very different personalities. _____ is a freewheeling womanizer, even with his brother's girlfriend _____. He also proves to have a yellow streak when it comes to his Night Patrol duties. ___ is made of strong moral fiber and attempts to keep his brother in line. Both volunteer for an extremely risky two man bombing mission for different reasons. _____ wants to lose his cowardly reputation and ___ seeks to protect his brother. Their assignment to knock out a strategic German munitions facility is a booming success, but with a squadron of fighters bearing down on them afterwards, escape seems unlikely.", "labels": ["PROTA_0", "ANTAG_0", "PROTA_1", "PROTA_2", "LOVE_0", "ANTAG_0", "ANTAG_1", "ANTAG_0"]}
{"text": "ID: 521\tTITLE: Hog Wild\tGENRE: Short, Comedy\tPLOT: Mrs. _____ insists that ______ mount the radio aerial on the roof before he goes off gallivanting with his friend _______. But with _______'s assistance, ______ spends more time falling off the roof than atop it. Making one last attempt, ______ climbs to the top of a ladder he's mounted on his Model T Ford, but just then _______ accidentally starts the car. A wild ride through the streets of ___________ culminates in an unscheduled streetcar stop.", "labels": ["LOVE_0", "PROTA_0", "PROTA_1", "PROTA_1", "PROTA_0", "PROTA_0", "PROTA_1", "FLAT_0"]}
{"text": "ID: 522\tTITLE: Just Imagine\tGENRE: Comedy, Fantasy, Musical, Romance, Sci-Fi\tPLOT: ________, 1980: airplanes have replaced cars, numbers have replaced names, pills have replaced food, government-arranged marriages have replaced love, and test tube babies have replaced ... well, you get the idea. Scientists revive a man struck by lightning in 1930; he is rechristened \"Single O\". He is befriended by J-21, who can't marry the girl of his dreams because he isn't \"distinguished\" enough -- until he is chosen for a 4-month expedition to Mars by a __________________. The Mars J-21, his friend, and stowaway Single O visit is full of scantily clad women doing ______________-style dance numbers and worshiping a fat middle-aged man.", "labels": ["LOC_0", "OCCUP_0", "PROTA_0"]}
{"text": "ID: 523\tTITLE: King of Jazz\tGENRE: Animation, Music\tPLOT: This revue presents its numbers around the orchestra leader _____________, besides that it shows in it's final number that the European popular music are the roots of American popular music, called Jazz.", "labels": ["FLAT_0"]}
{"text": "ID: 524\tTITLE: Ladies of Leisure\tGENRE: Drama, Romance\tPLOT: ____________ is the son of a rich ___________, but wants to be a _______. He hires Kay Arnold, a good girl with a bad past, as a model. They fall in love, and plan to get married. But _____'s parents raise strong objections.", "labels": ["PROTA_0", "OCCUP_0", "OCCUP_1", "PROTA_1"]}
{"text": "ID: 525\tTITLE: The Laurel-Hardy Murder Case\tGENRE: Short, Comedy, Crime, Mystery\tPLOT: It looks like the boys won't need to fish off the end of the pier to feed themselves any longer when _______'s rich uncle _______________ dies, leaving a large estate. But when he and ______ arrive for the reading of the will, they learn that ________ was murdered, and that ____, along with all the other relatives, is a prime suspect.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "PROTA_3", "PROTA_4"]}
{"text": "ID: 526\tTITLE: Little Caesar\tGENRE: Action, Crime, Drama, Romance\tPLOT: ____ is a small-time hood who knocks off gas stations for whatever he can take. He heads east and signs up with ___________'s mob. A New Year's Eve robbery at __________________'s casino results in the death of the new crime commissioner _____________. Rico's good friend ___________, who works at the club as a professional ______, works as the gang's lookout man and wants out of the gang. ____ is ambitious and eventually takes over Vettori's gang; he then moves up to the next echelon pushing out Diamond ____________. When he orders ___ to dump his girlfriend ____ and re-join the gang, ____ decides there's only one way out for them.", "labels": ["PROTA_0", "LOVE_0", "FLAT_0", "FLAT_1", "LOVE_1", "OCCUP_0", "PROTA_0", "FLAT_2", "PROTA_1", "LOVE_2", "PROTA_2"]}
{"text": "ID: 527\tTITLE: Madam Satan\tGENRE: Musical, Romance, Comedy\tPLOT: ______ and __________ are an upper class couple. Unfortunately, ___ is an unfaithful husband. But ______ has a plan to win back her husband's affections. An elaborate masquerade ball is to be held aboard a magnificent dirigible. ______ will attend and disguise herself as a mysterious devil woman. Hidden behind her mask, and wrapped in an alluring gown, ______ as the devil woman will to try to seduce her unknowing husband and teach him a lesson.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "PROTA_0", "LOVE_0", "PROTA_0"]}
{"text": "ID: 528\tTITLE: Min and Bill\tGENRE: Comedy, Drama\tPLOT: Min owns the waterfront hotel where ____, the _______ of a fishing boat, lives. Also living and working in the hotel is _____, whom ___ took in some years ago as an abandoned girl. Now that _____ is older, the truant officer and the police think that she should be moved to a different environment, and Min is torn between her attachment to _____ and her concern that the waterfront may not be the best place for a young woman. Matters are brought to a head by the sudden re-appearance of _____, _____'s disreputable mother.", "labels": ["FLAT_0", "OCCUP_0", "LOVE_0", "LOVE_1", "PROTA_0", "FLAT_1", "LOVE_2", "PROTA_0"]}
{"text": "ID: 529\tTITLE: Monte Carlo\tGENRE: Adventure, Comedy, Family, Romance\tPLOT: A young woman, her uptight step sister and her best friend use their savings for a long anticipated dream trip to _____, which turns out to be a big disappointment. When they decide to take a break from their lousy tour and duck into the lobby of a luxury hotel, one of them is mistaken for a spoiled British heiress. Before they get the chance to reveal their true identities they are wrapped up in misadventures during a vacation to ___________ instead.", "labels": ["LOC_0", "LOC_1"]}
{"text": "ID: 530\tTITLE: Morocco\tGENRE: Drama, Romance\tPLOT: The Foreign Legion marches in to _______ with booze and women in mind just as ______ _________ arrives from _____ to work at Lo Tinto's cabaret. That night, insouciant legionnaire _________ catches her inimitably seductive, tuxedo-clad act. Both bruised by their past lives, the two edge cautiously into a no-strings relationship while being pursued by others. But ___ must leave on a perilous mission: is it too late for them?", "labels": ["LOC_0", "OCCUP_0", "PROTA_0", "LOC_1", "FLAT_0", "PROTA_1"]}
{"text": "ID: 531\tTITLE: Night Owls\tGENRE: Comedy, Drama\tPLOT: After workaholic _____ has a drunken one night stand with the beautiful train-wreck ________, he's horrified to discover that she's actually his boss' jilted ex-mistress. When she takes a bottle of sleeping pills, _____ is forced to keep her awake... and over the course of the night the two begin to fall for each other.", "labels": ["PROTA_0", "LOVE_0", "PROTA_0"]}
{"text": "ID: 532\tTITLE: Our Blushing Brides\tGENRE: Drama\tPLOT: Three department store girls--______, ______, and _____--share an apartment on West 91st Street in _____________. Each earns little more than 20 dollars per week. _____ is the sensible one, but the others throw themselves at amoral rich men in an attempt to hook one and better themselves. They end up being hurt and disappointed despite _____'s attempts to warn them.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "LOC_0", "PROTA_2", "PROTA_2"]}
{"text": "ID: 533\tTITLE: Within the Law\tGENRE: Crime, Drama, Romance\tPLOT: ___________, is wrongly accused, by her employer _____________, and then convicted of theft. In prison she studies law books, and on release partners with another woman to legally scam wealthy men, including ___________, son of her accuser.", "labels": ["LOVE_0", "LOVE_1", "FLAT_0"]}
{"text": "ID: 534\tTITLE: Paid\tGENRE: Drama, Film-Noir\tPLOT: ___________ goes up for three years on a crime she didn't commit. Once out she and former prison mates plan a scam in which old men can be sued for breach of promise - the \"heart balm\" racket. After plotting verious ways to get back at the men who set her up initially, she softens and settles down.", "labels": ["LOVE_0"]}
{"text": "ID: 535\tTITLE: Raffles\tGENRE: Adventure, Comedy, Crime, Drama, History, Romance, Thriller\tPLOT: Man about town and First Class cricketer ____________ keeps himself solvent with daring robberies. Meeting ____ from his schooldays and falling in love all over again, he spends the weekend with her parents, Lord and Lady _______. A necklace presents an irresistible temptation, but also in attendance is Scotland Yard's finest, finally on the trail.", "labels": ["FLAT_0", "PROTA_0", "FLAT_1"]}
{"text": "ID: 536\tTITLE: Remote Control\tGENRE: Comedy, Crime\tPLOT: Since his mother wants to watch TV, ____, a young auto-mechanic, must recover her remote control, accidentally taken by his punk sister ____. During his quest, he becomes involved in the conflict between ____, the liquor smuggler, and ____, a night club owner who wants to be Iceland's first mafia boss.", "labels": ["PROTA_0", "PROTA_1", "ANTAG_0", "PROTA_2"]}
{"text": "ID: 537\tTITLE: The Story of the Fox\tGENRE: Animation, Comedy, Family\tPLOT: In the kingdom of animals, __________ is used to trick and fool everyone. So ________, the Lion, receives more and more complaints about him. He orders that __________ is arrested and ...", "labels": ["PROTA_0", "PROTA_1", "PROTA_0"]}
{"text": "ID: 538\tTITLE: Romance\tGENRE: Drama\tPLOT: Although deeply in love with her boyfriend - and indeed sleeping in the same bed with him - a schoolteacher cannot handle the almost complete lack of intimacy he will allow. Increasingly frustrated, she gradually finds her sexual appetites leading her into ever more risky situations, including a developing one with the headmaster.", "labels": []}
{"text": "ID: 539\tTITLE: The Blood of a Poet\tGENRE: Fantasy\tPLOT: A young ______ draws a face at a canvas on his easel. Suddenly the mouth on the drawing comes into life and starts talking. The ______ tries to wipe it away with his hand, but when he looks into the hand he finds the living mouth on his palm. He tries to wipe it off on the mouth of an unfinished statue of a young woman. The statue comes into life and tells him that the only way out of the studio is through the looking glass. The ______ jumps into the mirror and comes to the Hotel of Dramatic Lunacies. He peeps through the keyholes of a series of hotel rooms. In the last room he sees desperate meetings of hermaphrodites. One of them has a signboard saying \"Mortal danger\". Back in the studio the ______ crushes the statue with a sledgehammer. Because of this he himself becomes a statue, located at the side of a square. Some schoolboys start a snowball fight around the statue. One of the boys is killed by a snowball. A fashionable couple start playing cards at a table beside the corpse. The woman tells the man that unless he holds the ace of hearts he is doomed. The man takes the ace of hearts from the dead boy. The child's guardian, a black angel, appears and takes away the corpse as well as the card. Losing the ace of hearts the man shoots himself. The woman is transformed into the unfinished statue from the studio, and walks away.", "labels": ["OCCUP_0", "OCCUP_0", "OCCUP_0", "OCCUP_0"]}
{"text": "ID: 540\tTITLE: Up the River\tGENRE: Comedy, Crime, Drama\tPLOT: Two prisoners, ___________ and _____________, escape during a theatrical production in order to go to the aid of _____, a former ________ whose past is about to be exposed by the man who framed ____ unless _____ agrees to help him commit another crime.", "labels": ["FLAT_0", "PROTA_0", "FLAT_1", "OCCUP_0", "PROTA_1", "FLAT_1"]}
{"text": "ID: 541\tTITLE: Way Out West\tGENRE: Comedy, Family, Western\tPLOT: ____ and _____ are charged with delivering the deed to a valuable gold mine to the daughter of a dead __________. However they reckon without the machinations of her evil guardian ______ Finn who is determined to have the gold mine for himself and his saloon ______ wife ____.", "labels": ["PROTA_0", "PROTA_1", "OCCUP_0", "PROTA_2", "OCCUP_1", "LOVE_0"]}
{"text": "ID: 542\tTITLE: Way for a Sailor\tGENRE: Romance, Drama\tPLOT: ____ is a sailor who lives to go to sea. A typical sailor, he is always broke and has been in seven jails in the last seven ports. The one girl he tries to impress the most is in ______ and his mates call her 'the Eskimo'. For two years, he approaches her every time he docks near ______, and for two years, ____ rejects the expensive gifts he brings to her and ignores any and all advances he makes. She wants nothing to do with a sailor. When ____ uses trickery to convince ____ to marry him, ____ leaves him when she finds out the truth about his so called new life. There are rough seas ahead as ____ tries to get Joan to come back to him.", "labels": ["PROTA_0", "LOC_0", "LOC_0", "PROTA_1", "PROTA_0", "LOVE_0", "LOVE_0", "PROTA_0"]}
{"text": "ID: 543\tTITLE: Westfront 1918\tGENRE: Drama, Romance, War\tPLOT: A group of German infantrymen of the First World War live out their lives in the trenches of ______. They find brief entertainment and relief in a village behind the lines, but primarily terror fills their lives as the attacks on and from the French army ebb and flow. One of the men, ____, goes home on leave only to discover the degradation forced on his family by wartime poverty. He returns to the lines in time to face an enormous attack by French tanks.", "labels": ["LOC_0", "PROTA_0"]}
{"text": "ID: 544\tTITLE: Whoopee!\tGENRE: Comedy, Musical, Romance\tPLOT: Western _______ _________ is preparing to marry ____________; she loves part-Indian _______, whose race is an obstacle. _____ flees the wedding with hypochondriac ______________, who thinks he's just giving her a ride; but she left a note saying they've eloped! Chasing them are jilted ___, _____'s nurse ____ (who's been trying to seduce him) and others.", "labels": ["OCCUP_0", "PROTA_0", "LOVE_0", "LOC_0", "FLAT_0", "PROTA_1", "ANTAG_0", "ANTAG_1", "LOVE_1"]}
{"text": "ID: 545\tTITLE: The Golden Age\tGENRE: Short, Comedy\tPLOT: In a re-imagining of the odd couple, we follow ______ and ______ as they travel to _______ for George's college reunion. Once there, chaos ensues as ______ attempts to woo a past love.", "labels": ["PROTA_0", "PROTA_1", "LOC_0", "PROTA_0"]}
{"text": "ID: 546\tTITLE: L'Age d'Or\tGENRE: Comedy, Drama\tPLOT: Bunuel's first feature has more of a plot than Un _____________ (1929), but it's still a pure Surrealist film, so this is only a vague outline. A man and a woman are passionately in love with one another, but their attempts to consummate that passion are constantly thwarted, by their families, the Church and bourgeois society.", "labels": ["PROTA_0"]}
{"text": "ID: 547\tTITLE: An American Tragedy\tGENRE: Crime, Drama, Romance\tPLOT: Having just reached adulthood, _______________ has always lamented his lot in life, he the only son of poor missionaries. He has gotten a peripheral view of society life, to which he aspires, in his work as a bellhop at an upscale hotel. If being truthful to himself, he would admit that he lacks moral strength, he often taking the easiest but perhaps not the most ethical path to protect himself. Forced to move from place to place out of circumstance, he ends up in ________, New York working at the Samuel Griffiths Collar and Shirt factory, ________________ his paternal uncle. Not knowing his uncle or his family, _____ only wants a chance to get ahead, not expecting anything else from his wealthy relations. After an apprenticeship, _____ ends up as the _______ in the stamping department. Despite a company rule forbidding foremen to fraternize with staff, especially those working in the same department, _____ begins an affair, a clandestine one out of necessity, with _____________, who works in the stamping department under him. Their love is an obsessive one, made all the more powerful due to its clandestine nature. That changes for _____ when he meets, through his wealthy relations, society maiden _______________, the two who immediately fall in love with each other. The extra draw of ______ over ____ is Sondra's standing in society. By this time, ____ informs him that she is pregnant with his child, she pressuring him to do right by her in getting married. Wanting to be with ______ instead, _____ contemplates murdering ____ by drowning her in a lake, he knowing that she doesn't know how to swim. Although _____ is ultimately unable to commit this act of murder and will do right in marrying ____, he, due to that lack of moral strength, nonetheless is caught in a resulting tragic situation for all involved.", "labels": ["PROTA_0", "LOC_0", "PROTA_1", "PROTA_2", "PROTA_2", "OCCUP_0", "PROTA_2", "LOC_1", "ANTAG_0", "PROTA_3", "FLAT_0", "PROTA_4", "LOVE_0", "PROTA_5", "PROTA_2", "PROTA_4", "PROTA_2", "PROTA_4"]}
{"text": "ID: 548\tTITLE: The Bachelor Father\tGENRE: Comedy, Drama, Romance\tPLOT: Lonely in his English country estate, Sir _____ decides to gather his grown (albeit illegitimate) children around him in his declining years. He uses a ledger which keeps track of the payments he has been making to ex-lovers to locate 2 of them, and a third is found by a ______ in ________, her mother was too proud to accept any money. Sir _____ is a curmudgeon, and his three adult children have a hard time with him at first. ____, the American, is a free spirit who had a budding career in show business. _______ is English and a semi-gentleman, and _____ is Italian, with a Latin temperament. They begin to bond, especially Sir _____ and ____, whose outgoing personality finally wins over the old man. But past lives begin to creep back into the picture and threaten the old man's plans for a life filled with his children.", "labels": ["PROTA_0", "OCCUP_0", "LOC_0", "FLAT_0", "PROTA_1", "PROTA_2", "LOVE_0", "FLAT_0", "PROTA_1"]}
{"text": "ID: 549\tTITLE: Bad Girl\tGENRE: Drama, Romance\tPLOT: A mug and a jane: _______ knows that every guy is going to make a pass at her; _____ knows that every gal wastes her money on good times. He's saving to open a repair shop. When the two of them meet, they can't believe they get along. One evening he leaves her waiting in the rain; she finds his apartment and reads him the riot act. They end up spooning and napping until 4 AM. She's afraid of her brother, who's her guardian, so _____ figures she should tell her brother that she's getting married the next morning. _______ tries out the story but knows _____ won't show up. It's the first of a series of promises, fears, miscalculations, and hard knocks. Where will they end up?", "labels": ["PROTA_0", "FLAT_0", "PROTA_1", "PROTA_0", "PROTA_1"]}
{"text": "ID: 550\tTITLE: The Bad Sister\tGENRE: Drama\tPLOT: ________ falls in love with con man _________ who uses their relation to get her father's endorsement on a money-raising scheme. He runs off with the money and ________, later dumping her. Her sister _____ loves Dr. _______ although she knows he loves ________. ________ returns and marries a wealthy young man, and _______ turns his love toward _____.", "labels": ["PROTA_0", "FLAT_0", "PROTA_0", "PROTA_1", "PROTA_2", "PROTA_0", "PROTA_0", "PROTA_2", "PROTA_1"]}
{"text": "ID: 551\tTITLE: Gambling Daughters\tGENRE: Mystery\tPLOT: While trailing the school French teacher, Professor Bedoin, hoping to catch him in a romantic interlude, _______________ and __________________, students at the exclusive Lakeside School for Girls, follow him to _____________, a gambling joint and learn that he is a regular ______ there. _____________, the _______ and henchman of a mysterious and unseen owner, induces the girls to play on credit. Lillian, the younger of the two, falls in love with ______, and over a period of days, writes him several passionate love letters. When the girls have lost several thousand dollars at the crooked roulette wheels, ______ uses the letters as a club to make the girls steal valuable family jewels to make good their losses. The thefts bring insurance investigator Jimmy ______ to the school posing as a gym instructor. He stumbles upon a clue which makes _________ confess her part in the crimes, and with this to work on, he sets out to trap the club's ring leader.", "labels": ["PROTA_0", "PROTA_1", "LOC_0", "OCCUP_0", "LOC_1", "OCCUP_1", "PROTA_2", "PROTA_2", "LOC_2", "LOVE_0"]}
{"text": "ID: 552\tTITLE: Be Big!\tGENRE: Short, Comedy\tPLOT: On their way to the train station with their wives for a vacation in _____________, _______ and ______ get a phone call from a fellow lodge member who tells them a surprise stag party in their honor is being held that evening. ______ feigns illness to get out of the trip, and the wives head off to the train station by themselves. _______'s attempts to help ______ get into his lodge uniform turn into a series of disasters. Meanwhile, the wives miss the last train and, returning to discover the deception, come after their husbands with shotguns.", "labels": ["LOC_0", "PROTA_0", "PROTA_1", "PROTA_1", "PROTA_0", "PROTA_1"]}
{"text": "ID: 553\tTITLE: Beau Hunks\tGENRE: Short, Comedy\tPLOT: Jilted by his girlfriend, \"_____________,\" ______ joins the Foreign Legion to forget, bringing _______ along with him. They wilt under the scorching desert sun and under the harsh discipline of the Commandant. On a long march to reinforce remote _________, the boys get lost in the sands, finally reaching the Fort only to find it besieged by the fearsome Riffs.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "LOVE_0"]}
{"text": "ID: 554\tTITLE: Bimbo's Initiation\tGENRE: Animation, Short, Comedy, Family, Fantasy\tPLOT: _____ finds himself surrounded by a mysterious group of robed figures who invite him to become a member of their secret organization. When he refuses, they fling him through a nightmarish sequence of terror and torture devices. Will our hapless hero make it out alive?", "labels": ["PROTA_0"]}
{"text": "ID: 555\tTITLE: The Black Camel\tGENRE: Crime, Mystery, Thriller\tPLOT: __________ ____________ is seeing wealthy ___________ while filming in ________, ______, but won't marry him without consulting famed psychic _________ first. _________ confronts her about the unsolved murder of fellow film star __________ three years earlier, and she decides to reject Jaynes' proposal. When ______ is found shot to death in her beach-front pavilion, _______ Chan of the Honolulu Police investigates.", "labels": ["OCCUP_0", "ANTAG_0", "PROTA_0", "LOC_0", "LOC_1", "LOC_2", "PROTA_1", "PROTA_2", "PROTA_3", "PROTA_4"]}
{"text": "ID: 556\tTITLE: Blonde Crazy\tGENRE: Comedy, Crime, Drama, Romance\tPLOT: At a midwestern hotel, conniving bellhop Bert Harris has a finger in every pie. He promotes a job for glamorous ___________, but she does not immediately succumb to his charms. However, ____ soon enlists ___ as partner in his new profession of con man. Most of the victims they fleece are lawbreakers themselves. But ____ is tempted to try actual stealing, and ___ fears it will bring bad luck...", "labels": ["LOVE_0", "PROTA_0", "PROTA_1", "PROTA_0", "PROTA_1"]}
{"text": "ID: 557\tTITLE: The Champ\tGENRE: Drama, Sport\tPLOT: ___________, a former boxing champion, is now horse trainer in _______. He makes just enough money to raise his little boy ____, over whom he got custody after his wife _____ left him seven years ago. ____ worships The Champ who is now working on his come-back in order to give his boy a better future. But suddenly _____ shows up again ...", "labels": ["PROTA_0", "LOC_0", "PROTA_1", "LOVE_0", "PROTA_1", "LOVE_0"]}
{"text": "ID: 558\tTITLE: Chickens Come Home-\tGENRE: Short, Comedy\tPLOT: _____ is running for mayor when an old flame (Mae Busch) tries to blackmail him with a old photo ('just the same old apple-cheeked boy'). Stan's attempts to help _____ keep the blackmailer at bay incur the wrath of the shrewish Mrs Laurel who takes her revenge with an axe.", "labels": ["PROTA_0", "PROTA_0"]}
{"text": "ID: 559\tTITLE: La Chienne\tGENRE: Crime, Drama\tPLOT: _______ _______________ is married to _____, a terror. By chance, he meets ________, \"____\", and makes her his mistress. He thinks he finally met love, but ____ is nothing but a streetwalker, in love with ____, her pimp. She only accepts Legrand to satisfy Dede's needs of money.", "labels": ["OCCUP_0", "PROTA_0", "FLAT_0", "PROTA_1", "PROTA_2", "PROTA_2", "FLAT_1"]}
{"text": "ID: 560\tTITLE: Cimarron\tGENRE: Drama, Western\tPLOT: When the government opens up the Oklahoma territory for settlement, restless _____________ claims a plot of the free land for himself and moves his family there from _______. A newspaperman, ______, and just about everything else, ______ soon becomes a leading citizen of the boom town of Osage. Once the town is established, however, he begins to feel confined once again, and heads for the Cherokee Strip, leaving his family behind. During this and other absences, his wife _____ must learn to take care of herself and soon becomes prominent in her own right.", "labels": ["ANTAG_0", "LOC_0", "OCCUP_0", "PROTA_0", "LOVE_0"]}
{"text": "ID: 561\tTITLE: City Lights\tGENRE: Comedy, Drama, Romance\tPLOT: A tramp falls in love with a beautiful blind girl. Her family is in financial trouble. The tramp's on-and-off friendship with a wealthy man allows him to be the girl's benefactor and suitor.", "labels": []}
{"text": "ID: 562\tTITLE: City Streets\tGENRE: Crime, Drama, Film-Noir, Romance\tPLOT: ___, a racketeer's daughter, is in love with _______, a shooting gallery showman. Despite ___'s prodding, _______ has no ambitions about joining the rackets and making enough money to support ___ in the lifestyle she's accustomed to. Her attitude changes after her father implicates her in a murder and she's sent to prison. During her incarceration, her father convinces _______ to join the gang in order to help free ___. When ___ is released, she wants nothing more to do with the mob and tries to get The ___ to quit, but she may be too late.", "labels": ["LOVE_0", "FLAT_0", "FLAT_1", "FLAT_0", "PROTA_0", "FLAT_0", "LOVE_0", "LOVE_0", "ANTAG_0"]}
{"text": "ID: 563\tTITLE: Come Clean\tGENRE: Short, Comedy\tPLOT: The ______, hoping to avoid having the Laurels drop in and spoil their quiet evening, pretend not to be home when the couple inevitably call. But their subterfuge is discovered, and to make the best of it, _______ and ______ go out to buy ice cream. On the way, they spot ____, a woman wanted by the police, jump in the river. They save her, only to have her blackmail them into supporting her, or else she'll claim they tried to kill her. Back home, troubles ensue when the boys try to keep their wives from learning what they've brought home instead of ice cream.", "labels": ["FLAT_0", "PROTA_0", "PROTA_1", "FLAT_1"]}
{"text": "ID: 564\tTITLE: The Criminal Code\tGENRE: Crime, Drama, Romance\tPLOT: A wily D.A.(Brady) gets a 10 year conviction of a young 20 year old (Robert Graham)who he knows killed a man in self defense. Years later _____ becomes warden of the prison holding ______. When _____ realizes that 6 years of working in the prison jute mill has pushed ______ to the breaking point, he gives him a chance- a new job as his valet. ______ responds well and earns the respect of both the warden and his beautiful daughter. Graham's mettle is put to the test when he stumbles onto a prison murder committed by his cell-mate. He must choose between the criminal code of silence and the warden's strong persuasion to reveal the killer.", "labels": ["PROTA_0", "FLAT_0", "PROTA_0", "ANTAG_0", "FLAT_0"]}
{"text": "ID: 565\tTITLE: Dance, Fools, Dance\tGENRE: Crime, Drama, Romance\tPLOT: After her father ______________ loses his wealth in market, ______ goes to work as a cub ________. Her brother ______ is the wheel man in a gangland massacre. ____, a ________ on ______'s paper, is murdered while investigating. ______ gets to know gang leader _________ and learns how the gang works and that her brother is involved. By the time it's over her wealthy friend ___ sees how wonderful she is and falls in love with her for good.", "labels": ["FLAT_0", "PROTA_0", "OCCUP_0", "PROTA_1", "PROTA_2", "OCCUP_0", "PROTA_0", "LOVE_0", "LOVE_1", "ANTAG_0"]}
{"text": "ID: 566\tTITLE: Just a Gigolo\tGENRE: Comedy, Romance\tPLOT: Haines plays the role of a festive British ________, for whom a marriage has been arranged by his relatives. He goes to a European Summer resort and poses as a gigolo to meet the girl chosen, learn what she's like and to apply the \"acid test\".", "labels": ["OCCUP_0"]}
{"text": "ID: 567\tTITLE: Dirigible\tGENRE: Adventure\tPLOT: A French explorer enlists the help of the US Navy in an expedition to ______________. There is competition between the airship division and fixed wing fliers, resolved in triumph and disasters.", "labels": ["LOC_0"]}
{"text": "ID: 568\tTITLE: Dracula\tGENRE: Fantasy, Horror\tPLOT: After a harrowing ride through the Carpathian mountains in eastern ______, ________ enters castle Dracula to finalize the transferral of Carfax Abbey in ______ to _____________, who is in actuality a vampire. ________ is drugged by the eerily hypnotic count, and turned into one of his thralls, protecting him during his sea voyage to ______. After sucking the blood and turning the young ___________ into a vampire, _______ turns his attention to her friend ___________, daughter of Dr. ______ who then calls in a specialist, Dr. ___________, to diagnose the sudden deterioration of Mina's health. ___________, realizing that Dracula is indeed a vampire, tries to prepare Mina's fiance, ___________, and Dr. ______ for what is to come and the measures that will have to be taken to prevent ____ from becoming one of the undead.", "labels": ["LOC_0", "PROTA_0", "LOC_1", "LOC_2", "PROTA_0", "LOC_1", "LOVE_0", "PROTA_1", "FLAT_0", "FLAT_1", "ANTAG_0", "PROTA_2", "FLAT_2", "FLAT_1", "PROTA_3"]}
{"text": "ID: 569\tTITLE: Drácula\tGENRE: Fantasy, Horror\tPLOT: At midnight on Walpurgis Night, an English _____, ________, arrives at Count Dracula's castle in the ____________________. After signing papers to take over a ruined abbey near ______, _______ drives ________ mad and commands obedience. ________ escorts the boxed count on a death ship to ______. From there, the Count is introduced into the society of his neighbor, Dr. ______, who runs an asylum. _______ makes short work of family friend, ____________, then begins his assault on __________, the doctor's daughter. A visiting expert in the occult, ___________, recognizes Dracula for who he is, and there begins a battle for ___'s body and soul.", "labels": ["OCCUP_0", "PROTA_0", "LOC_0", "LOC_1", "PROTA_1", "PROTA_0", "PROTA_0", "LOC_1", "FLAT_0", "ANTAG_0", "LOVE_0", "LOVE_1", "PROTA_2", "LOVE_2"]}
{"text": "ID: 570\tTITLE: The Beggar's Opera\tGENRE: Crime, History, Musical\tPLOT: Authentic rendering of ________'s 18th century musical, filmed in Technicolor, about Captain MacHeath, a highwayman, and his love for too many beautiful women. Betrayed by _____ and _____, two of his bygone lovers, and temporarily freed by two others, ________ is arrested and condemned to death. While waiting to be hanged, the _______ is entertained by a musical beggar, who has written an opera of which the highwayman is the hero.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "PROTA_3", "OCCUP_0"]}
{"text": "ID: 571\tTITLE: Five Star Final\tGENRE: Crime, Drama\tPLOT: Hinchcliffe, the ruthless publisher of a sleazy ________ tabloid, is concerned that the ethical journalistic policies of ___________________ have caused a drop in circulation. He pressures the newsman to run more sensational stories including resurrecting the twenty year old Vorhees Murder Case. Although the perpetrator's actions were ultimately judged justifiable, and she has been subsequently living an exemplary life in anonymity, ___________ insists _______ revisit the story. _______ assigns Isopod, an alcoholic degenerate, to dig up anything lurid that he find. The unprincipled reporter fraudulently insinuates himself into the Vorhees' home masquerading as a minister and gets the expose he sought. Yellow journalism triumphs, and a decent woman's name gets dragged through the mud again... with tragic consequences.", "labels": ["LOC_0", "PROTA_0", "LOVE_0", "PROTA_1", "PROTA_1"]}
{"text": "ID: 572\tTITLE: Five and Ten\tGENRE: Drama, Romance\tPLOT: ____ owns the largest chain of five and ten cent stores in the country. He moves his family to ________ from ___________ and their life, though grand, is falling apart due to his constant working. Wife and mother _____ is lonely. Son _____ hates his job. Daughter ________ is snubbed by classmate ______ and her friends. At a charity bazaar, ________ meets _____ and sparks are evident. However, he is engaged to ______ and ______ will make sure that she, and only she, marries Berry. After the marriage, _____ still thinks of Jennifer as ________ thinks of Berry. _____ laments about the state of his family since they were happy in ___________.", "labels": ["PROTA_0", "LOC_0", "LOC_1", "PROTA_1", "PROTA_2", "PROTA_3", "LOVE_0", "PROTA_3", "PROTA_4", "LOVE_0", "PROTA_5", "PROTA_4", "PROTA_3", "PROTA_2", "LOC_1"]}
{"text": "ID: 573\tTITLE: A Free Soul\tGENRE: Crime, Drama, Romance\tPLOT: ____________, an upper class alcoholic defense attourney, successfully defends local mobster Ace Wilfong in a murder case. After his daughter ________ breaks her engagement to polo player _______________ and starts an affair with _______, she finds that the liason is not easily severed when she wants out. ________ earns Miss ____'s true affections by killing _______ to break his grip on her. Now the question is, can Stephen ____ save ________ with an impassioned defense speech to the jury?", "labels": ["PROTA_0", "LOVE_0", "PROTA_1", "FLAT_0", "PROTA_2", "FLAT_1", "FLAT_0", "PROTA_3", "LOC_0"]}
{"text": "ID: 574\tTITLE: The Front Page\tGENRE: Comedy, Drama, Romance\tPLOT: When _____________, the top ________ of a Chicago newspaper announces that he is quitting to get married, his editor, ____________ desperately tries to change his mind. When denial, cursing, and luring don't work, ______ resorts to tricks. It's the day before a supposed communist is to be hanged, and all _______ waits with baited breath. Meanwhile, each of the papers has a man on the story trying to get a scoop or angle for themselves. With a train to catch at midnight to join his fiancé, _____ is at first not interested, but events and his own habits work against him as the day unfolds, and he can't help but get roped in, especially when the man to be executed escapes and then almost literally falls into his lap.", "labels": ["LOVE_0", "OCCUP_0", "PROTA_0", "FLAT_0", "LOC_0", "PROTA_1"]}
{"text": "ID: 575\tTITLE: Gentleman's Fate\tGENRE: Crime, Drama\tPLOT: ____ lives the high life and wants to make ________ his one and only. He then learns that his deceased father is alive but dying of lead poisoning. His father sent him away, twenty years before, to keep him out of the rackets. But now that he is dying, he wants to split the business between _______ (Jack) and _____, his other son. The business includes running booze down from ______.", "labels": ["PROTA_0", "PROTA_1", "ANTAG_0", "PROTA_2", "LOC_0"]}
{"text": "ID: 576\tTITLE: Girls About Town\tGENRE: Comedy\tPLOT: Gold-diggers Kay Francis and ______________ meet susceptible lonely businessmen at conventions in this ribald preproduction code story. The millionaires lavish the girls with expensive gifts. _______ falls for poor but virtuous ___________. _______________ is a copper king who gives _______ jewelry. His wife reacts not with jealously but by trying to imitate her rival's style.", "labels": ["PROTA_0", "PROTA_1", "FLAT_0", "PROTA_2", "PROTA_3"]}
{"text": "ID: 577\tTITLE: Guilty Hands\tGENRE: Drama, Crime\tPLOT: _____________ is a ______ who believes that murder under certain circumstances is justifiable. Richard's daughter, _______, takes her dad to a dinner party hosted by Richard's old friend, wealthy playboy, ___________. ______ tells _______ that he and _______ plan to marry. _______ threatens ______'s life if he marries _______. _______ is unaware that _______ has no plans to marry ______, and she's in love with ____________. _______ enraged of the thought of _______ marrying ______ goes into ______'s room, undetected, and kills him...Has _______ committed the perfect crime?", "labels": ["PROTA_0", "OCCUP_0", "PROTA_1", "LOVE_0", "LOVE_1", "PROTA_2", "PROTA_1", "PROTA_2", "LOVE_1", "PROTA_1", "PROTA_2", "PROTA_1", "LOVE_1", "FLAT_0", "PROTA_2", "PROTA_1", "PROTA_3", "LOVE_1", "PROTA_2"]}
{"text": "ID: 578\tTITLE: Illicit\tGENRE: Drama, Romance\tPLOT: ___, a young lady of scandalously \"advanced\" ideas, has been living in near-sin with blueblood lover ____, due to her conviction that marriage will destroy their love. Finally, social pressure forces them to marry; in due course, it looks as if ___ was right. Her solution: to separate and return to dating. Can this marriage be saved?", "labels": ["PROTA_0", "FLAT_0", "PROTA_0"]}
{"text": "ID: 579\tTITLE: Indiscreet\tGENRE: Comedy, Romance\tPLOT: ___________ is a ______ based _______. She has been unable to find love in her life. The reason why she came home early from a vacation to _______ fits into that theme, as the man she met there and was initially attracted to ended up not being who she thought he was as a man. Upon her arrival home, she meets the suave ____________, a financier who is a work acquaintance of her brother-in-law, diplomat _____________. ______ initially states that there is no Mrs. _____ in his life. But when ____ later asks him out, he clarifies that statement in that there is no Mrs. _____ in ______, as she is at home in _____________. Regardless, ____ decides still to ask him on the date she had intended to the ballet. He accepts, letting her know that whatever happens between the two of them that he will never be able to leave his wife. As time goes on, the two fall in love, their happiness which can only be sustained as long as ______ has his Paris-based contract with NATO. So when ______ announces that he is being transferred to ________ for five months, ____ comes to the realization that she truly cannot live without him and wants to marry him. Shortly thereafter, ____ learns something about ______'s background, which not only threatens their relationship, but leads to a night that ____ wants to give him that he will never forget, and not in a good way. But the best laid plans may have a bumpy road to being executed effectively...", "labels": ["PROTA_0", "LOC_0", "OCCUP_0", "LOC_1", "LOVE_0", "LOVE_1", "PROTA_1", "PROTA_2", "PROTA_3", "PROTA_2", "LOC_0", "LOC_2", "PROTA_3", "PROTA_1", "PROTA_1", "LOC_3", "PROTA_3", "PROTA_3", "FLAT_0", "LOVE_2"]}
{"text": "ID: 580\tTITLE: Single Lady\tGENRE: Romance\tPLOT: Successful ______ and media darling Bright is an icon of singledom. However, a fortune-teller's warning of dire consequences resulting from unresolved issues with former lovers forces her to revisit and reexamine her five past relationships and calls her renunciation of romance into question.", "labels": ["OCCUP_0"]}
{"text": "ID: 581\tTITLE: The Last Flight\tGENRE: Drama\tPLOT: Cary, ____, ____, and _______ are pilots who have just, and only just, survived the First World War. They linger in ______ in the aftermath, drinking and ostensibly having fun, but pessimistic and flip about their futures, as each feels himself somehow lost and dead inside as a result of the horrors he's experienced. They encounter a beautiful and vivacious girl, _____, and adopt her, not romantically but as a sort of mascot and light around which they can hover in hopes of regaining a sense of warmth and life. _____ does her best to reinvigorate her new friends, but despite the seeming lightheartedness of their escapades, the shadow of the war can never be dispelled.", "labels": ["PROTA_0", "FLAT_0", "PROTA_1", "LOC_0", "PROTA_2", "PROTA_2"]}
{"text": "ID: 582\tTITLE: Laughing Gravy\tGENRE: Short, Comedy\tPLOT: _______ and ______ try unsuccessfully to keep their pet dog, _______________\" hidden from their grumpy landlord, who throws the pooch out into the snow. The rescue and further attempts to hide the dog result in mayhem, which is interrupted by the arrival of a registered letter informing _______ that he's inherited a fortune from his rich uncle. There's one catch, though: he has to renounce his friendship with ______, who the uncle characterizes as a \"nitwit.\"", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "PROTA_0", "PROTA_1"]}
{"text": "ID: 583\tTITLE: Laughing Sinners\tGENRE: Drama, Romance\tPLOT: Cafe entertainer ___________ falls for sleazy ________ _____________ and jumps from a bridge when he dumps her. Saved by Salvation Army officer ____, ___ reforms and joins the Army. When she runs into ______ she falls for him all over again. ____ beats up ______ and gives a speech to ___ which induces her to return to the Army and to ____.", "labels": ["FLAT_0", "OCCUP_0", "LOVE_0", "PROTA_0", "PROTA_1", "FLAT_1", "PROTA_0", "PROTA_2", "LOVE_1", "FLAT_2"]}
{"text": "ID: 584\tTITLE: The Smiling Lieutenant\tGENRE: Comedy, Romance, Musical\tPLOT: Lieutenant Niki of the Austrian royal guard has a new girlfriend, ______. He's crazy about her and is smiling at her while on duty in the street. King _____ and his daughter _____________ from the neighboring kingdom of Flausenthurm drive by, and ____ intercepts a wink meant for ______. She falls for ____, marries him (he has no choice in the matter), and whisks him off to ____________. ______ follows and enjoys a brief affair with ____ before ____ finds out. ______, much more experienced in the ways of the world, gives ____ lessons on how to win the affections of her husband.", "labels": ["FLAT_0", "FLAT_1", "LOVE_0", "PROTA_0", "FLAT_0", "PROTA_1", "LOC_0", "PROTA_2", "PROTA_1", "PROTA_0", "LOVE_1", "PROTA_0"]}
{"text": "ID: 585\tTITLE: Murderers Among Us\tGENRE: Drama, Romance, Thriller, War\tPLOT: Susanne Wallner returns to the ruins of ______ from a Concentration Camp after WW2 to discover that someone else lives in her apartment: Dr. ____________, the war made him depressive and he drinks a lot of alcohol. _______ asks him to go but he doesn't want to, so they share Susanne's apartment and even discover their sympathy and then their love for each other. That encourages him a little, of course. But then he hears that __________________ is still alive and also lives in ______. ________ was his Captain during WW2, he gave the order to kill more than 100 innocent people, many children and women among them, on _________ 1942 in ______.", "labels": ["LOC_0", "ANTAG_0", "PROTA_0", "PROTA_1", "LOC_0", "PROTA_2", "LOC_1", "LOC_2"]}
{"text": "ID: 586\tTITLE: M\tGENRE: Crime, Mystery, Thriller\tPLOT: In _______, ____________ is an unknown killer of girls. He whistles Edvard Grieg's 'In The Hall of the Mountain King', from the 'Peer Gynt' Suite I Op. 46 while attracting the little girls for death. The police force pressed by the Minister give its best effort trying unsuccessfully to arrest the _____________. The organized crime has great losses due to the intense search and siege of the police and decides to chase the murderer, with the support of the beggars association. They catch ____ and briefly judge him.", "labels": ["LOC_0", "PROTA_0", "OCCUP_0", "PROTA_1"]}
{"text": "ID: 587\tTITLE: The Mad Genius\tGENRE: Drama, Horror, Romance\tPLOT: A crippled _________ rescues an abused young boy and turns the boy into a great ballet dancer. Complications ensue when, as a young man, the ______ falls in love with a young woman the _________ is also in love with.", "labels": ["OCCUP_0", "OCCUP_1", "OCCUP_0"]}
{"text": "ID: 588\tTITLE: The Maltese Falcon\tGENRE: Film-Noir, Mystery\tPLOT: _____ and Archer is the name of a _____________ detective agency. That's for _________ and Miles Archer. The two men are partners, but ___ doesn't like _____ much. A knockout, who goes by the name of Miss ________, walks into their office; and by that night everything's changed. Miles is dead. And so is a man named _____________. It seems Miss Wonderly is surrounded by dangerous men. There's Joel Cairo, who uses gardenia-scented calling cards. There's Kasper ______, with his enormous girth and feigned civility. Her only hope of protection comes from ___, who is suspected by the police of one or the other murder. More murders are yet to come, and it will all be because of these dangerous men -- and their lust for a statuette of a bird: the Maltese Falcon.", "labels": ["PROTA_0", "LOC_0", "FLAT_0", "PROTA_1", "FLAT_1", "FLAT_2", "FLAT_3", "PROTA_2", "PROTA_1"]}
{"text": "ID: 589\tTITLE: Man of the World\tGENRE: Drama, Romance\tPLOT: A young American girl visits _____ accompanied by her fiancee and her wealthy uncle. There she meets and is romanced by a worldly novelist; what she doesn't know is that he is a blackmailer who is using her to get to her uncle.", "labels": ["PROTA_0"]}
{"text": "ID: 590\tTITLE: ______'s Orphans\tGENRE: Family, Comedy, Animation, Short\tPLOT: Christmas; ______ and ______ are singing carols. Someone drops a basket on the doorstep that has what seems like hundreds of kittens; they quickly overrun the house. ______ dresses as Santa, with _____ as a reindeer, and brings gifts for the kittens. The kittens form a marching band, using kitchen implements; other kittens take saws, hammers, and other tools to the furniture. A kitten uses his toy steam shovel to drop a hot coal down ______'s pants; two more come up with a toy fire engine. ______ unveils the tree; the kittens swarm over it and strip it bare.", "labels": ["PROTA_0", "FLAT_0", "LOVE_0", "PROTA_0", "FLAT_1", "PROTA_0", "PROTA_0"]}
{"text": "ID: 591\tTITLE: Le Million\tGENRE: Musical, Comedy\tPLOT: ______, a Parisian ______, is being hounded by numerous impatient creditors. To make things worse, when he is embracing the woman whose portrait he is painting, he is surprised by his indignant fiancée ________. Suddenly, ______ learns that he holds the winning ticket in the Dutch Lottery. But when he goes to retrieve the ticket from the pocket of his jacket, he finds that ________ has given the jacket to a stranger who was in need. Now everyone has a keen interest in finding that jacket.", "labels": ["PROTA_0", "OCCUP_0", "PROTA_1", "FLAT_0", "PROTA_1"]}
{"text": "ID: 592\tTITLE: The Miracle Woman\tGENRE: Drama, Romance\tPLOT: After Florence Fallon's father dies unappreciated in the church where he preached for many years, she becomes embittered and loses faith. She teams up with ______, a con man, and performs fake miracles for profit. But the love and trust of a blind man restores her faith in ___ and her fellow man.", "labels": ["LOVE_0", "PROTA_0"]}
{"text": "ID: 593\tTITLE: Monkey Business\tGENRE: Comedy, Sci-Fi\tPLOT: ______________ is a research _______ working on a fountain of youth pill for a chemical company. While trying a sample dose on himself, he accidentally gets a dose of a mixture added to the water cooler and believes his potion is what is working. The mixture temporarily causes him to feel and act like a teenager, including correcting his vision. When his wife gets a dose that is even larger, she regresses even further into her childhood. When an old boyfriend meets her in this state, he believes that her never wanting to see him again means a divorce and a chance for him.", "labels": ["PROTA_0", "OCCUP_0"]}
{"text": "ID: 594\tTITLE: Night Nurse\tGENRE: Comedy, Crime, Drama\tPLOT: _________ manages to land a job in a hospital as a trainee nurse. Upon completion of her training she goes to work as a night nurse for two small children who seem to be very sick, but something much more sinister is going on.", "labels": ["PROTA_0"]}
{"text": "ID: 595\tTITLE: One Good Turn\tGENRE: Short, Comedy\tPLOT: ____ and _____ are down on their luck and beg at an old lady's house for food. While they are eating they overhear a villainous landlord (Finlayson) threatening to evict her if she does not pay the mortgage. Not realizing that they are hearing a rehearsal for a play, the boys decide to auction their car to help. In the confusion surrounding the auction, ____ finds himself in possession of a fat wallet and _____ accuses him of stealing the old lady's money. When the truth is revealed, ____ exacts painful retribution.", "labels": ["PROTA_0", "PROTA_1", "PROTA_0", "PROTA_1", "PROTA_0"]}
{"text": "ID: 596\tTITLE: Other Men's Women\tGENRE: Drama, Romance\tPLOT: Railroad _______ __________ is a carefree ladies' man with an irresponsible streak. His buddy ___________, an engineer, is more solid and reliable. ____ comes to stay a while with ____ and his wife ____. ____ and Lily fall in love, but not wishing to hurt ____, ____ leaves without explanation. When ____ confronts ____ about his suspicions, the two fight and ____ is seriously injured. ____ is consumed with guilt and tries to make good, but ____ has his own ideas about that.", "labels": ["OCCUP_0", "PROTA_0", "PROTA_1", "PROTA_2", "PROTA_3", "FLAT_0", "FLAT_1", "PROTA_3", "PROTA_2", "PROTA_3", "FLAT_1", "PROTA_3", "PROTA_2", "PROTA_3"]}
{"text": "ID: 597\tTITLE: Our Wife\tGENRE: Short, Comedy\tPLOT: ______'s plans to marry his hefty sweetheart go awry when the girl's father gets a load of her intended groom. They then elope in a tiny car much too small for their combined dimensions, ...", "labels": ["PROTA_0"]}
{"text": "ID: 598\tTITLE: The Painted Desert\tGENRE: Western\tPLOT: Western pardners ____ and ____ find a baby boy in an otherwise deserted emigrants' camp, and clash over which is to be \"father.\" They are still bitterly feuding years later when they own adjacent ranches. ____, the foundling whom ____ has raised to young manhood, wants to end the feud and extends an olive branch toward ____, who now has a lovely daughter. But during a mining venture, the bitterness escalates. Is ____ to be set against his own adoptive father?", "labels": ["PROTA_0", "PROTA_1", "FLAT_0", "PROTA_1", "PROTA_0", "FLAT_0"]}
{"text": "ID: 599\tTITLE: Pardon Us\tGENRE: Comedy, Crime, Drama, Musical\tPLOT: It's Prohibition, and the boys wind up behind bars after ____ sells some of their home-brew beer to a _________. In prison, ____'s loose tooth keeps getting him in trouble, because it sounds like he's giving everybody a rasp- berry. But it earns him the respect of The Tiger, a rough prisoner, and the boys manage to slip away during The Tiger's escape attempt. They disguise themselves in blackface and hide on a cotton plantation, but are recaptured when the ______ happens by. Back in the big house, they find themselves in a hail of bullets, caught between the state militia and gun-toting prisoners, when The Tiger tries another escape.", "labels": ["PROTA_0", "OCCUP_0", "PROTA_0", "OCCUP_1"]}
{"text": "ID: 600\tTITLE: Their First Mistake\tGENRE: Comedy, Short\tPLOT: Mrs. _____ is irate that her husband ______ spends more time with his friend _______ than with her. ______ decides to adopt a baby, hoping that it will keep his wife occupied so that he and _______ can continue to carouse. But upon returning home with the infant, they find a process server with a divorce summons, and spend a sleepless night caring for the squalling baby.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "PROTA_1", "PROTA_2"]}
{"text": "ID: 601\tTITLE: Parlor, Bedroom and Bath\tGENRE: Comedy\tPLOT: ____ wants to get married to ________, but ________ won't marry until her older, hard-to-please sister ________ gets married off first. ____ pretends that a shy, never-married nobody he has just met is really a great lover, in order to get ________ interested in him.", "labels": ["PROTA_0", "FLAT_0", "FLAT_0", "PROTA_1", "PROTA_0", "PROTA_1"]}
{"text": "ID: 602\tTITLE: The Phantom of Paris\tGENRE: Drama, Thriller\tPLOT: Bibi is a world class escape ______, but he cannot escape the false murder charge that is placed on him. ___ has killed __________ before he was removed from the will so that he will be rich when he marries ______. Together with ____, they put the blame on ____, who is a romantic rival to ___, and he is sentenced to death. But ____ escapes before his execution and hides in Herman's secret cellar. When he learns that ___ is dying, ____ goes to his house for his confession, but ___ dies before it is told to anyone else. So ____, has just one chance, and he goes to Dr. _____ who will make him look like ___ so that he can clear his name and put the blame where it belongs - on ___, even in death.", "labels": ["OCCUP_0", "PROTA_0", "PROTA_1", "LOVE_0", "LOVE_1", "PROTA_2", "FLAT_0", "PROTA_2", "FLAT_0", "PROTA_2", "FLAT_0", "LOVE_2", "FLAT_1", "FLAT_0", "PROTA_0"]}
{"text": "ID: 603\tTITLE: Platinum Blonde\tGENRE: Comedy, Romance\tPLOT: Reporter Gallagher loves ________ _____ who marries Anne. He's soon bored being married to a socialite and asks _________ to help him write a play. She arrives with a bunch of _________ and the mansion turns into a party. ____ arrives and orders them out and _____ goes with them.", "labels": ["OCCUP_0", "FLAT_0", "FLAT_1", "OCCUP_1", "FLAT_2", "PROTA_0"]}
{"text": "ID: 604\tTITLE: Possessed\tGENRE: Crime, Drama, Film-Noir, Thriller\tPLOT: A woman wanders the streets of Los Angeles in some sort of emotional distress. She is also under some delusion as she approaches many men, strangers who she calls \"David\". Eventually, an ambulance is called, the attendants who take her to the hospital, where she is eventually placed in the psychiatric ward. Placing her under some medication to help her remember, Dr. ______________, the psychiatrist on duty, is able to get some semblance of a story out of her over the ensuing days. This phase of her life begins just over a year ago when she, single __ _____________, is under the employ of wealthy ___________ to take care of his chronically ill and largely bedridden wife, ______________, at their lake house outside of __________, DC. Due to her circumstances, _______ believes that ____ and ______ are carrying on an affair behind her back. ______ can see that ____ does have feelings for her that way in his loneliness. The \"David\" in question is ____________, a civil engineer who lives across the lake from ___________, he with who ______ had been having a secret relationship. That relationship was always meant to be casual, but _____ tries to break it off with her when he sees that she has fallen in love with him to an obsessional state. ______ begins to manipulate the situation to be in David's life, even if only peripherally. ______ also begins to feel that if she can't have David, nobody else should. ______ is eventually diagnosed with schizophrenia during this time - something she does not mention to anyone in her life - which places her story to Dr. _______ in some context, including what of the story is real and what is all part of her delusion.", "labels": ["ANTAG_0", "OCCUP_0", "PROTA_0", "FLAT_0", "FLAT_1", "LOC_0", "PROTA_1", "FLAT_2", "FLAT_3", "FLAT_3", "LOVE_0", "PROTA_2", "ANTAG_1", "FLAT_3", "PROTA_3", "ANTAG_2", "PROTA_4", "FLAT_3", "LOVE_1"]}
{"text": "ID: 605\tTITLE: The Mirage\tGENRE: Short, Comedy\tPLOT: How many people have you killed in a video game? What if every character you killed was a real person? How many people have you killed in video games? What if every character you ever ...", "labels": []}
{"text": "ID: 606\tTITLE: Private Lives\tGENRE: Comedy, Drama, Romance\tPLOT: _____ and _____ are being married in a big church ceremony. ______ and ______ are being married by a French Justice of the Peace. Both couples go to a hotel on the same day and are put in adjoining rooms with adjoining terraces. Things go fine until ______ sees her former husband _____ on the adjacent terrace. While they both pretend to be happy, both make plans to leave, but their spouses do not want to leave as it is their respective honeymoons. So the other spouses each go down to the bar. This leaves _____ and ______ together and they reminisce. Before long, the sparks again fly and they both decide to leave together to the Mountains of Switzerland. They love, they bicker, they fight, they stop. Then it begins over and over. Then ______ and Sibyl show up at their chalet.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "ANTAG_0", "PROTA_2", "LOVE_0", "PROTA_0", "PROTA_2", "ANTAG_0"]}
{"text": "ID: 607\tTITLE: The Public Enemy\tGENRE: Crime, Drama\tPLOT: __________ and __________ are best friends and fellow gangsters, their lives frowned upon by ___'s straight laced brother, ____, and ____'s straight laced sister, Molly. From their teen-aged years into young adulthood, ___ and ____ have an increasingly lucrative life, bootlegging during the Prohibition era. But ___ in particular becomes more and more brazen in what he is willing to do, and becomes more obstinate and violent against those who either disagree with him or cross him. When one of their colleagues dies in a freak accident, a rival bootlegging faction senses weakness among ___ and ____'s gang, which is led by __________. A gang war ensues, resulting in _____ suggesting that ___ and ____ lay low. But because of ___'s basic nature, he decides instead to take matters into his own hands.", "labels": ["PROTA_0", "PROTA_1", "PROTA_2", "PROTA_3", "LOVE_0", "PROTA_2", "PROTA_4", "PROTA_2", "PROTA_2", "PROTA_4", "LOVE_1", "PROTA_5", "LOVE_2", "PROTA_4", "PROTA_2"]}
{"text": "ID: 608\tTITLE: Safe in Hell\tGENRE: Crime, Drama\tPLOT: Sought by the ___________ police for accidentally killing the man who raped her and forced her into prostitution, a woman flees New Orleans for a Caribbean island. Surrounded by lecherous criminals, she awaits the return of her fiancé and seems to be holding her own until the treachery of the local police chief leaves her but one choice to gain her freedom.", "labels": ["LOC_0"]}
{"text": "ID: 609\tTITLE: The Secret 6\tGENRE: Crime, Drama\tPLOT: Bootlegger/cafe owner Ralph Bellamy recruits crude working man Wallace Beery to join his gang which is masterminded by crooked criminal defense ______ ___________. _____ eventually takes over _______'s operation, beats a rival gang, becomes wealthy and dominates the city for several years until a secret group of 6 masked businessmen have him prosecuted and sent to the electric chair with the help of rival crusading newspapermen Clark Gable and _________________. ____________________ is torn between her love for the honest newsman _____ and her financial dependence on her generous boss, _____.", "labels": ["OCCUP_0", "PROTA_0", "PROTA_1", "PROTA_2", "PROTA_3", "PROTA_4", "PROTA_5", "PROTA_1"]}
{"text": "ID: 610\tTITLE: The Sin of Madelon Claudet\tGENRE: Drama\tPLOT: French country girl _______ falls for artist _____, who leaves her after she becomes pregnant. She finds help from jewel thief _____, but he commits suicide when the police try to arrest him. _______ is arrested and receives a ten year term in prison for assisting him in his profession. To support her son, who does not know that she's been in prison, she becomes a street walker, allowing him to attend medical school.", "labels": ["LOVE_0", "PROTA_0", "FLAT_0", "PROTA_1"]}
{"text": "ID: 611\tTITLE: Smart Money\tGENRE: Crime, Drama\tPLOT: ______________, an immigrant Greek ______, has an uncommon affinity for poker and other sorts of wagering and a group of his friends bankroll him in a big game, where his weakness for pretty blondes is taken advantage of by sleazy ________ __________ who cleans him out in a rigged game. ____ accepts help from his buddy ____ as they turn the tables on the grifters, but triumph soon changes to tragedy.", "labels": ["ANTAG_0", "OCCUP_0", "OCCUP_1", "ANTAG_1", "ANTAG_2", "PROTA_0"]}
{"text": "ID: 612\tTITLE: The Star Witness\tGENRE: Drama\tPLOT: The _____ family is thrown right in the middle of a war between the ____ and gangland when they are the only witnesses to two murders committed by gang kingpin ____________. Initially positive in their identification of the murderer, their attitudes change when young ___________ is kidnapped by Campos' boys. No amount of threatening with perjury by _____________ can get them to tell the truth - except for cantankerous old Grandpa, civil war veteran, who berates his family for failing to do their civic duty, whatever the cost. Though having his doubts as to the credibility of his star witness, ________ is nevertheless taken aback when he learns _______ has disappeared just before he is to testify.", "labels": ["FLAT_0", "OCCUP_0", "FLAT_1", "PROTA_0", "FLAT_2", "PROTA_1", "PROTA_2"]}
{"text": "ID: 613\tTITLE: Street Scene\tGENRE: Drama, Romance\tPLOT: In a hot summer afternoon in ________, __________ gossips with other neighbors of her residential building about the affair of Mrs. _____________ and the milkman ____________. When the rude Mr. ______________ arrives, they change the subject. Meanwhile, their teenage daughter _____________ is sexually harassed by her boss Mr. ___________; however, she likes her Jewish ________ ___ that has a crush on her. On the next morning, _____ tells that is traveling to ________ on business. Mrs. ________ meets the gentle Sankey in her apartment, but out of the blue _____ comes back home in an announced tragedy.", "labels": ["LOC_0", "PROTA_0", "PROTA_1", "FLAT_0", "FLAT_1", "PROTA_2", "PROTA_3", "OCCUP_0", "PROTA_4", "PROTA_5", "FLAT_2", "PROTA_6", "PROTA_5"]}
{"text": "ID: 614\tTITLE: Svengali\tGENRE: Drama, Horror, Romance, Sci-Fi\tPLOT: Sinister music maestro Svengali can control the actions of women through hypnotism and his telepathic powers. When a pupil he has seduced announces she has left her husband for him, he uses his powers to cause her suicide and promptly forgets her. He meets a beautiful model, ______, and becomes infatuated with her, but she, in turn, falls for a young ______ called ______ who also loves her. One day ________ hypnotizes ______ to cure her headache, but also examines her upper palate and decides it is an ideal cavity for great singing. He convinces her to fake her suicide, so Billee and friends will forget her, and goes on a singing tour with her. ________ uses his powers to make her sing wonderfully and _______________, as ______ is now known, becomes a sensation throughout ______. But ______ discovers the ruse and begins to follow the pair, upsetting ________ enough to have him cancel performances too frequently, so they no longer can perform in ______. They go to _____, but ______ relentlessly follows.", "labels": ["LOVE_0", "OCCUP_0", "FLAT_0", "PROTA_0", "LOVE_0", "PROTA_0", "PROTA_1", "LOVE_0", "LOC_0", "PROTA_2", "PROTA_0", "LOC_0", "LOC_1", "PROTA_2"]}
